WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
/*********************************************************************************************************//**
 * @file    bc5602_host.c
 * @version $Rev:: 101          $
 * @date    $Date:: 2018-10-26 #$
 * @brief   This file provides all BC5602 HOST functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) 2016 Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "ht32_board.h"
#include <string.h>                          //memcmp
#include "softspi.h"
#include "spi_cmd.h"
#include "tmr50us.h"
#include "usart.h"
#include "sync_bch.h"
#include "bc5602_host.h"
#include "bc5602_host2.h"

/* Private variables ---------------------------------------------------------------------------------------*/
int debug_i=0;
int debug_MAX_RT=0;
int debug_TX_DS=0;
/* Global functions ----------------------------------------------------------------------------------------*/



/////////////////////////////////////////////////////////////////////////////////////////////
/**
 *  @addtogroup BC3601_Host_FSM1_public_by_Holtek_label
 *  @{
 */
typedef struct {
    unsigned char   trmode;
    unsigned int    state;
    u32             delay_offset;
} host5602_fsm1_holtek_TypeDef;
static volatile host5602_fsm1_holtek_TypeDef hfsm1;
/** @} */



/**
 *  @addtogroup SPI_spiTxQ_label
 *  @{
 */
hfsm1_spiTxQ_to_5602_TypeDef spiTxQ;
/** @} */

/**
 *  @addtogroup SPI_spiRxQ_label
 *  @{
 */
hfsm1_spiRxQ_from_5602_TypeDef spiRxQ;
/** @} */


/********************************************************************************/
#define IRQ3_IS_SET        (GPIO_ReadInBit(HT_GPIOD, GPIO_PIN_5)==SET)
#define IRQ3_IS_RESET      (GPIO_ReadInBit(HT_GPIOD, GPIO_PIN_5)==RESET)
/**
 *  @ingroup IRQ3_to_GPIO_label
 */
static void init_GPIO_IRQ3(void)
{
    //GPIO <--- IRQ3
    AFIO_GPxConfig(GPIO_PD, AFIO_PIN_5, AFIO_MODE_1);
    GPIO_DirectionConfig(HT_GPIOD, GPIO_PIN_5, GPIO_DIR_IN);
    GPIO_PullResistorConfig(HT_GPIOD, GPIO_PIN_5, GPIO_PR_UP);
    GPIO_InputConfig(HT_GPIOD, GPIO_PIN_5, ENABLE);
    //GPIO <--- IRQ3
    AFIO_GPxConfig(GPIO_PD, AFIO_PIN_14, AFIO_MODE_1);
    GPIO_DirectionConfig(HT_GPIOD, GPIO_PIN_14, GPIO_DIR_IN);
    GPIO_PullResistorConfig(HT_GPIOD, GPIO_PIN_14, GPIO_PR_UP);
    GPIO_InputConfig(HT_GPIOD, GPIO_PIN_14, ENABLE);
}
/**
 *  @ingroup IRQ3_to_GPIO_label
 */
/*
static bool GPIO_IRQ3_IS_SET(void)
{
    bool result;
    if(IRQ3_IS_SET) {result = TRUE;}
    else            {result = FALSE;}
    return result;
}*/
/**
 *  @ingroup IRQ3_to_GPIO_label
 */
static bool GPIO_IRQ3_IS_RESET(void)
{
    bool result;
    if(IRQ3_IS_RESET) {result = TRUE;}
    else              {result = FALSE;}
    return result;
}

//============================================================
#define write_PE0_SET_1       GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_0, SET)
#define write_PE1_SET_1       GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_1, SET)
#define write_PE2_SET_1       GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_2, SET)
#define write_PE3_SET_1       GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_3, SET)
#define write_PE4_SET_1       GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_4, SET)
#define write_PE5_SET_1       GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_5, SET)
#define write_PE6_SET_1       GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_6, SET)
#define write_PE7_SET_1       GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_7, SET)

#define write_PE0_RESET_0     GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_0, RESET)
#define write_PE1_RESET_0     GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_1, RESET)
#define write_PE2_RESET_0     GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_2, RESET)
#define write_PE3_RESET_0     GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_3, RESET)
#define write_PE4_RESET_0     GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_4, RESET)
#define write_PE5_RESET_0     GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_5, RESET)
#define write_PE6_RESET_0     GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_6, RESET)
#define write_PE7_RESET_0     GPIO_WriteOutBits(HT_GPIOE, GPIO_PIN_7, RESET)

/**
 *  @ingroup GPIO_debug_label
 */
void GPIO_ToggleOutBits(HT_GPIO_TypeDef* GPIOx,  u16 GPIO_PIN)
{
  FlagStatus Status;
//GPIO_CK_ST;
//Assert_Param(IS_GPIO(GPIOx));
//GPIO_CK_ON();
  Status = GPIO_ReadOutBit(GPIOx, GPIO_PIN);
  if (Status == RESET)
    GPIOx->SRR = GPIO_PIN;
  else
    GPIOx->RR = GPIO_PIN;
//GPIO_CK_OFF();
}
/**
 *  @ingroup GPIO_debug_label
 */
void set_PE_OUTPUT_MDOE(void)
{
  AFIO_GPxConfig(GPIO_PE, AFIO_PIN_0, AFIO_MODE_DEFAULT);
  AFIO_GPxConfig(GPIO_PE, AFIO_PIN_1, AFIO_MODE_DEFAULT);
  AFIO_GPxConfig(GPIO_PE, AFIO_PIN_2, AFIO_MODE_DEFAULT);
  AFIO_GPxConfig(GPIO_PE, AFIO_PIN_3, AFIO_MODE_DEFAULT);
  AFIO_GPxConfig(GPIO_PE, AFIO_PIN_4, AFIO_MODE_DEFAULT);
  AFIO_GPxConfig(GPIO_PE, AFIO_PIN_5, AFIO_MODE_DEFAULT);
  AFIO_GPxConfig(GPIO_PE, AFIO_PIN_6, AFIO_MODE_DEFAULT);
  AFIO_GPxConfig(GPIO_PE, AFIO_PIN_7, AFIO_MODE_DEFAULT);
  
  GPIO_DirectionConfig(HT_GPIOE, GPIO_PIN_0, GPIO_DIR_OUT);
  GPIO_DirectionConfig(HT_GPIOE, GPIO_PIN_1, GPIO_DIR_OUT);
  GPIO_DirectionConfig(HT_GPIOE, GPIO_PIN_2, GPIO_DIR_OUT);
  GPIO_DirectionConfig(HT_GPIOE, GPIO_PIN_3, GPIO_DIR_OUT);
  GPIO_DirectionConfig(HT_GPIOE, GPIO_PIN_4, GPIO_DIR_OUT);
  GPIO_DirectionConfig(HT_GPIOE, GPIO_PIN_5, GPIO_DIR_OUT);
  GPIO_DirectionConfig(HT_GPIOE, GPIO_PIN_6, GPIO_DIR_OUT);
  GPIO_DirectionConfig(HT_GPIOE, GPIO_PIN_7, GPIO_DIR_OUT);
  
  write_PE0_RESET_0;
  write_PE1_RESET_0;
  write_PE2_RESET_0;
  write_PE3_RESET_0;
  write_PE4_RESET_0;
  write_PE5_RESET_0;
  write_PE6_RESET_0;
  write_PE7_RESET_0;
}

//============================================================
static volatile unsigned char dm1_mdiv_sdr ;
static volatile unsigned char dm1_mdiv_sel ;
//============================================================
                                                    //      DM1  [7:4]RSSI_CTHD
static volatile unsigned char dm1_aw ;
                                                    //0x00, DM1  [3:2]=00: -
                                                    //0x04, DM1  [3:2]=01: 3 bytes IDCODE
                                                    //0x08, DM1  [3:2]=10: 4 bytes IDCODE
                                                    //0x0C, DM1  [3:2]=11: 5 bytes IDCODE
static volatile unsigned char dm1_d_rate ;
                                                    //0x00, DM1  [1:0]=00: 250 Kbps datarate
                                                    //0x01, DM1  [1:0]=01:   1 Mbps datarate
static volatile unsigned char pkt1_crc_en ;
                                                    //      PKT1 
static volatile unsigned char pkt1_crc8_en ;
static volatile unsigned char pkt2_wht_en ;         //      PKT2 [7]Whitening, [6:0]seed
static volatile unsigned char dpl2_en_dyn_ack ;     //0x01, DPL2 [0]
static volatile unsigned char dpl2_en_ack_pld ;     //0x02, DPL2 [1]
static volatile unsigned char dpl2_en_dpl ;         //0x04, DPL2 [2]  9 bits PCF
static volatile unsigned char en_inv_noack ;        //0x80, DPL2 [7]inverse NO_ACK

