WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
  static address5602_TypeDef syncID_p0={P0_SYNCWORD, P0_LSBYTE};
  static address5602_TypeDef syncID_p1={P1_SYNCWORD, P1_LSBYTE};
  static address5602_TypeDef syncID_p2={P1_SYNCWORD, P2_LSBYTE};
  static address5602_TypeDef syncID_p3={P1_SYNCWORD, P3_LSBYTE};
  static address5602_TypeDef syncID_p4={P1_SYNCWORD, P4_LSBYTE};
  static address5602_TypeDef syncID_p5={P1_SYNCWORD, P5_LSBYTE};

//////////////////////////////////////////////////////
static void spi_read_rxfifo_to_spiRxQ(void)
{
    unsigned char read_length;
    read_length = spi_r(0x0C);      //PKT4 RO (strobe R_RX_PL_WID)
                                    //        [7:0](RO)RXDLEN
    if(read_length==0) {
        return;
    }
    spi_cmdd_BF_rxfifo_read(read_length, spiRxQ.payload + 0);
    spiRxQ.w_index = read_length;
}

/**
 *  @ingroup SPI_Commands_label
 */
static unsigned char spi_read_fifostatus(void)
{
    unsigned char status;
    status = spi_r(0x05);       // FIFO STATUS
    return status;
}
unsigned char spi_read_sta1_omst(void)
{
	/* OMST[2:0]: Operation mode state
	0h: Deep Sleep Mode
	1h: Middle Sleep Mode
	2h: Light Sleep Mode
	3h: Standby Mode
	4h: TX Mode
	5h: RX Mode
	6h: Calibration Mode
	*/
    unsigned char sta1;
//bank 0
    spi_cmd0_20_set_register_bank(0);
    sta1 = spi_r(0x26);         // sta1  <--- CR[0x26]STA1
//uart_puts("sta1="); uart_putu8(sta1); uart_putchar_n('\n');
    return sta1;
}
/**
 *  @ingroup SPI_Commands_label
 */
static void spi_clear_irq1(void)
{
    spi_w(0x04, 0x7E);          // IRQ1[7]-
                                //     [6]RX_DR,   write 1 to clear bit
                                //     [5]TX_DS,   write 1 to clear bit
                                //     [4]MAX_RT,  write 1 to clear bit
                                //     [3]ADDRESS, write 1 to clear bit
                                //     [2]BCMATCH, write 1 to clear bit
                                //     [1]RX_TO,   write 1 to clear bit
                                //     [0]-
}
static unsigned char spi_read_n_clear_irq1(void)
{
    unsigned char irq1;
    irq1 = spi_r(0x04);         // IRQ1
    if(irq1)
    spi_w(0x04, irq1);          // IRQ1[7]-
                                //     [6]RX_DR,   write 1 to clear bit
                                //     [5]TX_DS,   write 1 to clear bit
                                //     [4]MAX_RT,  write 1 to clear bit
                                //     [3]ADDRESS, write 1 to clear bit
                                //     [2]BCMATCH, write 1 to clear bit
                                //     [1]RX_TO,   write 1 to clear bit
                                //     [0]-
//uart_puts("irq="); uart_putu8(irq1); uart_putchar_n('\n');
    return irq1;
}
/**
 *  @ingroup SPI_spiTxQ_label
 */
/*
static void movedata_spiTxQ_to_print2sscom(void)
{
    unsigned int i;
    uart_puts("TXDLEN=");
    uart_putu8(spiTxQ.total_length);
//  uart_putchar_n('\n');
    uart_puts(", TX FIFO[]= ");
    for(i=0;i<spiTxQ.total_length;i++) {
        uart_putu8(spiTxQ.payload[i]);
        uart_puts(" ");
    }
    uart_putchar_n('\n');
    uart_putchar_n('\n');
    uart_putchar_n('\n');
}*/
void movedata_spiTxQ_to_ptx_txfifo(unsigned char strobeCmd)
{
        if     (strobeCmd==0x11) {
            spi_cmdd_11_txfifo_write(spiTxQ.total_length, spiTxQ.payload+0);
        }
        else if(strobeCmd==0x13) {
            spi_cmdd_13_txfifo_write_no_ack(spiTxQ.total_length, spiTxQ.payload+0);
        }
            spiTxQ.status = SPITXQ_STATUS_WAITING4_TX_COMPLETE;
}
static void movedata_spiTxQ_to_prx_txfifo(unsigned char pipe)
{
            spi_cmdd_18_txfifo_prx_w_ack_payload(pipe, spiTxQ.total_length, spiTxQ.payload+0);
            spiTxQ.status = SPITXQ_STATUS_WAITING4_TX_COMPLETE;
}
/**
 *  @ingroup BC3601_Host_FSM1_public_by_Holtek_label
 */
void movedata_to_spiTxQ(unsigned char pipe_no, unsigned char total_length, unsigned char *pch)
{
    unsigned char i;
        spiTxQ.remote_pipe_no = pipe_no;
        spiTxQ.total_length   = total_length;
    for(i=0; i<total_length; i++) {
        spiTxQ.payload[i] = *pch;    pch++;
    }
        
        spiTxQ.status = SPITXQ_STATUS_LOADED_BUT_NOT_YET_PROCESSED_BY_HFSM1;
}

#if   _FRONTEND_V_ == 23 // 5602 v3 fullmask
static void init_setting_5602v3_FCF(void)    // Fxtal=16MHz
{
//bank1
    spi_cmd0_20_set_register_bank(1);
  #if USE_IF_FREQ_K == 600
    spi_w(0x24, 0x03);              //FCF1
                                    //        [7:4]MOD_INDEX2[3:0]
                                    //        [3:0]MOD_INDEX1[3:0]
//  spi_w(0x25, 0x44);              //FCF2
    spi_w(0x25, 0xCC);//IF 600K     //FCF2
//  spi_w(0x25, 0x00);//IF   1M     //FCF2
                                    //        [7:0]FSCALE[7:0]
//  spi_w(0x26, 0x4C);//IF 600K 16M xtal //FCF3        RX's Fscale(change IF) = IF * 2^20 / (2 * Fxtal) = (600000 * 2^20)/(2*16000000) = 19660.8   19660=0x4CCC
    spi_w(0x26, 0x1C);//IF 600K 32M xtal //FCF3        RX's Fscale(change IF) = IF * 2^20 / (2 * Fxtal) = (600000 * 2^20)/(2*32000000) =  9830.4    9830=0x2666   1CCC
//  spi_w(0x26, 0x36);//IF   1M 32M xtal //FCF3        RX's Fscale(change IF) = IF * 2^20 / (2 * Fxtal) = (600000 * 2^20)/(2*32000000) =  9830.4    9830=0x2666   1CCC
                                    //        [7]-
                                    //        [6:0]FSCALE[14:8]
    spi_w(0x27, 0x80);//IF 600K     //FCF4
                                    //        [7]RXFD_EN
                                    //        [6]TXFD_EN
                                    //        [5:0]-
  #elif USE_IF_FREQ_K == 1000
    spi_w(0x24, 0x03);              //FCF1
                                    //        [7:4]MOD_INDEX2[3:0]
                                    //        [3:0]MOD_INDEX1[3:0]
//  spi_w(0x25, 0x44);              //FCF2
//  spi_w(0x25, 0xCC);//IF 600K     //FCF2
    spi_w(0x25, 0x00);//IF   1M     //FCF2
                                    //        [7:0]FSCALE[7:0]
//  spi_w(0x26, 0x4C);//IF 600K 16M xtal //FCF3        RX's Fscale(change IF) = IF * 2^20 / (2 * Fxtal) = (600000 * 2^20)/(2*16000000) = 19660.8   19660=0x4CCC
//  spi_w(0x26, 0x1C);//IF 600K 32M xtal //FCF3        RX's Fscale(change IF) = IF * 2^20 / (2 * Fxtal) = (600000 * 2^20)/(2*32000000) =  9830.4    9830=0x2666   1CCC
    spi_w(0x26, 0x36);//IF   1M 32M xtal //FCF3        RX's Fscale(change IF) = IF * 2^20 / (2 * Fxtal) = (600000 * 2^20)/(2*32000000) =  9830.4    9830=0x2666   1CCC
                                    //        [7]-
                                    //        [6:0]FSCALE[14:8]
    spi_w(0x27, 0x80);//IF 600K     //FCF4
                                    //        [7]RXFD_EN
                                    //        [6]TXFD_EN
                                    //        [5:0]-
  #endif
}
#endif

#if   _FRONTEND_V_ == 23 // 5602 v3 fullmask
static void init_setting_5602v3_DTR(void)
{
}
#endif

/**
 *  @ingroup SPI_Commands_label
 */
static void spi_write_2fpga_rxg(void)
{
//  macroCSN_SELECT_FPGA;
//  spi_cmd0_20_set_register_bank(2);
//  spi_w(0x21, RXG_GAIN);            //RXG    RX Path Gain setting PGA,BPF,MIX,LNA
}



static void init_1adc(void)
{
		
