WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
}

#if 1
static void __read_fpga_all_ctrl_registers(void)
{
    unsigned char addr, value;
//GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_0);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_0);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_0);
//GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_1);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_1);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_1);
//GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_2);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_2);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_2);
//GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_3);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_3);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_3);
//GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_4);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_4);    GPIO_ToggleOutBits(HT_GPIOE, GPIO_PIN_4);
    for(addr=0x00; addr<=0x1F; addr++)
    {
        value = spi_r(0xC0+addr);
        uart_puts("read reg["); uart_putu8(addr); uart_puts("]= "); uart_putu8(value); uart_puts("   ");
        if(addr==0x00) {uart_puts("CFG1");}
        if(addr==0x01) {uart_puts("RC1");}
        if(addr==0x02) {uart_puts("RC2");}
        if(addr==0x03) {uart_puts("MASK [7]-, [6]MASK_RX, [5]MASK_TX, [4]MASK_MAX_RT, [3]MASK_ADDRESS, [2]MASK_BCMATCH, [1]MASK_RX_TO, [0]PRIM_RX");}
        if(addr==0x04) {uart_puts("IRQ1 STATUS");}
        if(addr==0x05) {uart_puts("IRQ2 FIFO_STATUS read-only");}
        if(addr==0x06) {uart_puts("IO1 [7:6]PADDS,[5:3]GIO2S,[2:0]GIO1S");}
        if(addr==0x07) {uart_puts("IO2 [7:4]GIO4S,[3:0]GIO3S");}
        if(addr==0x08) {uart_puts("IO3 [7]SDO_TEN,[6]SPIPU,[5:0]GIOPU");}
        if(addr==0x09) {uart_puts("PKT1 [5]CRC_EN,[4]CRC8_EN,[3]PLLEN_EN");}
        if(addr==0x0A) {uart_puts("PKT2 [7]WHT_EN,[6:0]WHTSD");}
        if(addr==0x0B) {uart_puts("PKT3 [7]WHT_PCF_EN,[6:0]-");}
        if(addr==0x0C) {uart_puts("PKT4 read-only[7:0]RXDLEN");}
        if(addr==0x0D) {uart_puts("PKT5 [7]-[6:4]DLY_DEMOD, [3]-[2:0]DLY_TXS");}
        if(addr==0x0E) {uart_puts("MOD1 DTR[7:0]");}
        if(addr==0x0F) {uart_puts("MOD2 [7:5]-,[4]DITHER_EN,[3:2]DITHER,[1]DTR_EN,[0]DTR[8]");}
        if(addr==0x10) {uart_puts("RF_CH [7]-[6:0]RF_CH");}
        if(addr==0x11) {uart_puts("DM1 [7:6]AW,[5:3]-,[2]MDIV_SEL,[1:0]SDR");}
        if(addr==0x12) {uart_puts("DM2 [7:0]FD_HOLD");}
        if(addr==0x13) {uart_puts("RT1 [7:4]ARD, [3:0]ARC");}
        if(addr==0x14) {uart_puts("RT2 read-only[7:4]CNT_PLOS, [3:0]CNT_ARC");}
        if(addr==0x15) {uart_puts("CE [0]CE");}
        uart_putchar_n('\n');
    }
uart_putchar_n('\n');
    spi_cmd0_20_set_register_bank(0);
    for(addr=0x20; addr<=0x3A; addr++)
    {
        value = spi_r(0xC0+addr);
        uart_puts("bank 0 read reg["); uart_putu8(addr); uart_puts("]= "); uart_putu8(value); uart_puts("   ");
        uart_putchar_n('\n');
    }
uart_putchar_n('\n');
    spi_cmd0_20_set_register_bank(1);
    for(addr=0x20; addr<=0x27; addr++)
    {
        value = spi_r(0xC0+addr);
        uart_puts("bank 1 read reg["); uart_putu8(addr); uart_puts("]= "); uart_putu8(value); uart_puts("   ");
        if(addr==0x20) {uart_puts("AGC1");}
        if(addr==0x21) {uart_puts("AGC2");}
        if(addr==0x22) {uart_puts("AGC3");}
        if(addr==0x23) {uart_puts("AGC4");}
        if(addr==0x24) {uart_puts("FCF1");}
        if(addr==0x25) {uart_puts("FCF2");}
        if(addr==0x26) {uart_puts("FCF3");}
        if(addr==0x27) {uart_puts("FCF4");}
        uart_putchar_n('\n');
    }
uart_putchar_n('\n');
    spi_cmd0_20_set_register_bank(2);
    for(addr=0x20; addr<=0x3F; addr++)
    {
        value = spi_r(0xC0+addr);
        uart_puts("bank 2 read reg["); uart_putu8(addr); uart_puts("]= "); uart_putu8(value); uart_puts("   ");
        uart_putchar_n('\n');
    }
uart_putchar_n('\n');
    spi_cmd0_20_set_register_bank(3);
    for(addr=0x30; addr<=0x36; addr++)
    {
        value = spi_r(0xC0+addr);
        uart_puts("bank 3 read reg["); uart_putu8(addr); uart_puts("]= "); uart_putu8(value); uart_puts("   ");
        uart_putchar_n('\n');
    }
}
#endif
#if 0
static void check_ctrl_reg(unsigned char addr, unsigned char mask)
{
    unsigned char value, read[2];
    spi_cmd0_20_set_register_bank(2);
    for(value=0x00; value<=0xFE; value++) {
        spi_w(0x40|addr,value);
tmr50usGetCurrentTicks();//delay
        read[0] = spi_r(0xC0|addr);
        if( (value&mask)!=(read[0]&mask) ) {
            uart_puts("addr="); uart_putu8(addr); uart_puts("   w="); uart_putu8(value); uart_puts("   r= "); uart_putu8(read[0]); uart_putchar_n('\n');
        }
    }
}
static void __check_v1_all_ctrl_registers(void)
{
    unsigned char addr, value;

        check_ctrl_reg(0x00, 0x53);   spi_w(0x40,0x00);  //CFG1
//        check_ctrl_reg(0x01, 0xFF); //RC1
        check_ctrl_reg(0x02, 0x01);   spi_w(0x42,0x00);  //RC2
        check_ctrl_reg(0x03, 0x71);   spi_w(0x43,0x00);  //MASK
//      check_ctrl_reg(0x04, 0xFF); irq1
//RO    check_ctrl_reg(0x05, 0xFF); status
        check_ctrl_reg(0x06, 0xFF);   spi_w(0x46, 0x80|0x00); //IO1
        check_ctrl_reg(0x07, 0xFF);   spi_w(0x47, 0x50);      //IO2
        check_ctrl_reg(0x08, 0xFF);                           //IO3
        check_ctrl_reg(0x09, 0x30);   spi_w(0x49, 0x30);  //PKT1
        check_ctrl_reg(0x0A, 0xFF);   spi_w(0x4A, 0x00);  //[7]WHT_EN,     [6:0]seed
        check_ctrl_reg(0x0B, 0x80);   spi_w(0x4B, 0x00);  //[7]WHT_PCF_EN  [6:0]-
//RO    check_ctrl_reg(0x0C, 0xFF); RXDLEN
        check_ctrl_reg(0x0D, 0x77);   spi_w(0x4D, 0x27);  //PKT5
        check_ctrl_reg(0x0E, 0xFF);   spi_w(0x4E, 0x01);       //MOD1
        check_ctrl_reg(0x0F, 0x1F);   spi_w(0x4F, 0x14|0x00);  //MOD2
        check_ctrl_reg(0x10, 0x7F);   spi_w(0x50, RFCH_FRONTEND);
        check_ctrl_reg(0x11, 0xC7);   spi_w(0x51, dm1_aw|dm1_d_rate);//DM1
        check_ctrl_reg(0x12, 0xFF);   spi_w(0x52, 0x08);              //DM2
        check_ctrl_reg(0x13, 0xFF);   spi_w(0x53, 0xF1);              //RT1
//RO    check_ctrl_reg(0x14, 0xFF); RT2 (08_OBSERVE_TX)(Read-Only)
        check_ctrl_reg(0x15, 0x01);   spi_w(0x55, 0x00);              //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE

uart_putchar_n('\n');uart_putchar_n('\n');  uart_puts("bank 0"); uart_putchar_n('\n');
    spi_cmd0_20_set_register_bank(0);
        check_ctrl_reg(0x20, 0x8F);   spi_w(0x60, 0x00);  //OM
        check_ctrl_reg(0x21, 0xCF);   spi_w(0x61, 0x4F);              //CFO1
        check_ctrl_reg(0x25, 0x8F);   spi_w(0x65, 0x80);//SX4
        check_ctrl_reg(0x22, 0x7F);   //SX1
        check_ctrl_reg(0x23, 0xFF);   //SX2
        check_ctrl_reg(0x24, 0xFF);   //SX3
//RO    check_ctrl_reg(0x26, 0xFF); //STA1 (RO read only)
        check_ctrl_reg(0x27, 0x0F);   spi_w(0x67, 0x0A);              //RSSI1
//RO    check_ctrl_reg(0x28, 0xFF); //RSSI2 (RO read only)
//RO    check_ctrl_reg(0x29, 0xFF); //RSSI3 (RO read only)
        check_ctrl_reg(0x2A, 0x3F);   spi_w(0x6A, 0x00);              //DPL1
        check_ctrl_reg(0x2B, 0x07);   spi_w(0x6B, 0x00);              //DPL2
        #if 1
        check_ctrl_reg(0x2C, 0x3F);   spi_w(0x6C, 0x01);              //RXPW0
        check_ctrl_reg(0x2D, 0x3F);   spi_w(0x6D, 0x01);              //RXPW1
        check_ctrl_reg(0x2E, 0x3F);   spi_w(0x6E, 0x01);              //RXPW2
        check_ctrl_reg(0x2F, 0x3F);   spi_w(0x6F, 0x01);              //RXPW3
        check_ctrl_reg(0x30, 0x3F);   spi_w(0x70, 0x01);              //RXPW4
        check_ctrl_reg(0x31, 0x3F);   spi_w(0x71, 0x01);              //RXPW5
        check_ctrl_reg(0x32, 0x3F);   spi_w(0x72, 0x01);              //ENAA
        check_ctrl_reg(0x33, 0xFF);   spi_w(0x73, 0x01);              //P2B0
        check_ctrl_reg(0x34, 0xFF);   spi_w(0x74, 0x01);              //P3B0
        check_ctrl_reg(0x35, 0xFF);   spi_w(0x75, 0x01);              //P4B0
        check_ctrl_reg(0x36, 0xFF);   spi_w(0x76, 0x01);              //P5B0
        check_ctrl_reg(0x37, 0x3F);   spi_w(0x77, 0x01);              //ACTIVE
        #endif
        check_ctrl_reg(0x38, 0xFF);   spi_w(0x78, 0x13);              //XO1
        check_ctrl_reg(0x39, 0x18);   spi_w(0x79, 0x10);              //XO2
        check_ctrl_reg(0x3A, 0xFF);   spi_w(0x7A, 0x01);              //TX2

uart_putchar_n('\n');uart_putchar_n('\n');  uart_puts("bank 1"); uart_putchar_n('\n');
    spi_cmd0_20_set_register_bank(1);
        check_ctrl_reg(0x20, 0x1F);   //AGC1
        check_ctrl_reg(0x21, 0x07);   //AGC2
//RO    check_ctrl_reg(0x22, 0xF7);   //AGC3
        check_ctrl_reg(0x23, 0xFF);   //AGC4
        check_ctrl_reg(0x24, 0xFF);   //FCF1
        check_ctrl_reg(0x25, 0xFF);   //FCF2
        check_ctrl_reg(0x26, 0x7F);   //FCF3
        check_ctrl_reg(0x27, 0xC0);   //FCF4

uart_putchar_n('\n');uart_putchar_n('\n');  uart_puts("bank 2"); uart_putchar_n('\n');
    spi_cmd0_20_set_register_bank(2);
        check_ctrl_reg(0x20, 0x8F);   spi_w(0x60, 0x00);  //OM
        check_ctrl_reg(0x21, 0xFF);   spi_w(0x61, 0x97);              //RXG
        check_ctrl_reg(0x26, 0xFF);   spi_w(0x66, 0x01);              //CP1
        check_ctrl_reg(0x27, 0xFF);   spi_w(0x67, 0x66);              //CP2
        check_ctrl_reg(0x28, 0xFF);   spi_w(0x68, 0x0B);              //CP3
        check_ctrl_reg(0x29, 0xFF);   spi_w(0x69, 0x13);              //OD1
        check_ctrl_reg(0x2A, 0xFF);   spi_w(0x6A, 0x61);              //OD2
        check_ctrl_reg(0x2B, 0x5F);   spi_w(0x6B, 0x03);              //VC1
        check_ctrl_reg(0x2C, 0x1F);   
        check_ctrl_reg(0x2D, 0x3F);   spi_w(0x6D, 0x16);              //VC3
        check_ctrl_reg(0x2E, 0xFF);   spi_w(0x6E, 0xEF);              //RX1
        check_ctrl_reg(0x2F, 0x7F);   spi_w(0x6F, 0x5C);              //RX2
      //check_ctrl_reg(0x30, 0xFF);   spi_w(0x70, 0x0B);              //RX3
        check_ctrl_reg(0x31, 0xFF);   spi_w(0x71, 0x07);              //RX4
        check_ctrl_reg(0x32, 0x0F);   spi_w(0x72, 0x08);              //RX5
        check_ctrl_reg(0x33, 0x7F);   spi_w(0x73, 0x25);              //TX1
        check_ctrl_reg(0x34, 0xFF);   spi_w(0x74, 0x4F);              //TX2
        check_ctrl_reg(0x35, 0x7F);   spi_w(0x75, 0x23);              //TX3
        check_ctrl_reg(0x36, 0x0F);   spi_w(0x76, 0x02);              //TX4
        check_ctrl_reg(0x37, 0x9F);   
        check_ctrl_reg(0x38, 0x3F);   
        check_ctrl_reg(0x39, 0x1F);   spi_w(0x79, 0x67);              //CA3
        check_ctrl_reg(0x3A, 0xFF);   spi_w(0x7A, 0x57);              //LD1
        check_ctrl_reg(0x3B, 0xFF);   spi_w(0x7B, 0x57);              //LD2
        check_ctrl_reg(0x3C, 0xCF);   spi_w(0x7C, 0x45);              //LD3
        check_ctrl_reg(0x3D, 0xFF);   spi_w(0x7D, 0x13);              //XO1
        check_ctrl_reg(0x3E, 0x18);   spi_w(0x7E, 0x10);              //XO2
        check_ctrl_reg(0x3F, 0x2F);   //RTM1


uart_putchar_n('\n');uart_putchar_n('\n');  uart_puts("bank 3"); uart_putchar_n('\n');
    spi_cmd0_20_set_register_bank(3);
}
#endif

static void test_read_chip_version(void)
{
    unsigned char tmp[4];
    spi_cmdd_9F_read_chip_version(tmp+0);
    
    uart_puts("chip version= ");
    uart_putu8(tmp[0]);
    uart_putu8(tmp[1]);
    uart_putu8(tmp[2]);
    uart_putchar_n('\n');
}

static void init_syncID(void)
{
    address5602_TypeDef id;
    // set pipe 0 address
    #if 0
    if     (dm1_aw==0x04) // 3 bytes Address
        id.byte4321 = calc_syncword_16(LAP0_TO_CALC_SYNC); // (3-1) bytes syncword byte4321
    else if(dm1_aw==0x08) // 4 bytes Address
        id.byte4321 = calc_syncword_24(LAP0_TO_CALC_SYNC); // (4-1) bytes syncword byte4321
    else if(dm1_aw==0x0C) // 5 bytes Address
        id.byte4321 = calc_syncword_32(LAP0_TO_CALC_SYNC); // (5-1) bytes syncword byte4321
        id.byte0    = P0_LSBYTE;                           //<<<<<<<<<<<<<<
    syncID_p0.byte4321 = id.byte4321 ;

    uart_puts("pipe 0 BCH addr =");
    uart_putu8(id.byte4321>>24);
    uart_putu8(id.byte4321>>16);
    uart_putu8(id.byte4321>>8);
    uart_putu8(id.byte4321);
    uart_putu8(id.byte0);
    uart_putchar_n('\n');
    #endif
        spi_cmdd_10_write_pipe_0_ID(syncID_p0); //<<<<<<<<<<<
        spi_cmdd_90_read_pipe_0_ID(&id);
    uart_puts("read pipe 0 ID get ");
    uart_putu8(id.byte4321>>24);
    uart_putu8(id.byte4321>>16);
    uart_putu8(id.byte4321>>8);
    uart_putu8(id.byte4321);
    uart_putu8(id.byte0);
    uart_putchar_n('\n');
    // set pipe 1 address
    #if 0
    if     (dm1_aw==0x04) // 3 bytes Address
        id.byte4321 = calc_syncword_16(LAP1_TO_CALC_SYNC); // (3-1) bytes syncword byte4321
    else if(dm1_aw==0x08) // 4 bytes Address
        id.byte4321 = calc_syncword_24(LAP1_TO_CALC_SYNC); // (4-1) bytes syncword byte4321
    else if(dm1_aw==0x0C) // 5 bytes Address
        id.byte4321 = calc_syncword_32(LAP1_TO_CALC_SYNC); // (5-1) bytes syncword byte4321
        id.byte0    = P1_LSBYTE;                           //<<<<<<<<<<<<<<
    syncID_p1.byte4321 = id.byte4321 ;
    syncID_p2.byte4321 = id.byte4321 ;
    syncID_p3.byte4321 = id.byte4321 ;
    syncID_p4.byte4321 = id.byte4321 ;
    syncID_p5.byte4321 = id.byte4321 ;

    uart_puts("pipe 1 BCH addr =");
    uart_putu8(id.byte4321>>24);
    uart_putu8(id.byte4321>>16);
    uart_putu8(id.byte4321>>8);
    uart_putu8(id.byte4321);
    uart_putu8(id.byte0);
    uart_putchar_n('\n');
    #endif
        spi_cmdd_12_write_pipe_1_ID(syncID_p1); //<<<<<<<<<<<
        spi_cmdd_92_read_pipe_1_ID(&id);
    uart_puts("read pipe 1 ID get ");
    uart_putu8(id.byte4321>>24);
    uart_putu8(id.byte4321>>16);
    uart_putu8(id.byte4321>>8);
    uart_putu8(id.byte4321);
    uart_putu8(id.byte0);
    uart_putchar_n('\n');
}
static void init_5603_v4_sz_ic_20230615(void)
{
		
