WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
		int i;
		macroCSN_SELECT_FPGA;
    spi_cmd0_0A_deepsleep();
    spi_cmd0_0C_lightsleep();
    spi_cmd0_08_software_reset();

		spi_w(0x00, 0x00|0x40);              //CFG1,    Direct mode
                                    //[1:0]BANK[1:0] control register Bank select, 00:bank0, 01 : bank1, 10 : bank2, 11 : bank3
                                    //[3:2] -
                                    //[4]  DIR_EN direct mode enable
                                    //[5]  PN9_EN
                                    //[6]  AGC_EN
                                    //[7]  -

//bank 0		
		spi_cmd0_20_set_register_bank(0);
		//delay50 

		spi_w(0x02, 0x5C);              //RC2     
                                    //      v3[4]  PSAVE  Power saving mode control. XCLK's gating clock
                                    //      v3[5]  PSAVE1 Power saving mode control. XCLK's gating clock for RFCTRL
                                    //        [6]- XCLK_GEN		
		spi_w(0x03, 0x00);              //MASK (00_CONFIG) [7]-, [6]MASK_RX, [5]MASK_TX, [4]MASK_MAX_RT, [3]-, [2]-, [1]-, [0]PRIM_RX
                                    //        [6]  MASK_RX
                                    //        [5]  MASK_TX
                                    //        [4]  MASK_MAX_RT
                                    //        [0]  PRIM_RX
		spi_w(0x04, 0x70);              //IRQ1 (07_STATUS) [7]-, [6]RX_DR,   [5]TX_DS,   [4]MAX_RT, [3:1]RX_P_NO [0] TX_FULL(R)
                                    //        [7]  -
                                    //        [6]  RX_DR
                                    //        [5]  TX_DS
                                    //        [4]  MAX_RT
  //spi_w(0x05, 0x__);              //IRQ2 (17_FIFO_STATUS) (RO read only)
                                    //        [7]  -
                                    //        [6]  -        todo:TX_REUSE
                                    //        [5]  TX_FULL
                                    //        [4]  TX_EMPTY
                                    //        [3:2]-
                                    //        [1]  RX_FULL
                                    //        [0]  RX_EMPTY
																		
    spi_w(0x06, 0x80|0x28|0x01);         //IO1     [5:3]GIO2S[2:0]=0h:-     , [2:0]GIO1S[2:0]=0h:-      , [7:6]PADDS[1:0] PAD drive strength:0:0.5mA,1:1mA,2:5mA,3:10mA
    
  #if   _SPI_WIRES_ == 3
    spi_w(0x07, 0x00);              //IO2     [7:4]GIO4S[3:0]=5h:IRQ   , [3:0]GIO3S[3:0]=0h:-
  #elif _SPI_WIRES_ == 4
    //spi_w(0x07, 0x15);              //IO2     [7:4]GIO4S[3:0]=5h:IRQ   , [3:0]GIO3S[3:0]=0h:-
		//spi_w(0x07, 0x00);
		spi_w(0x07, 0x40);
  #endif
		  
    spi_w(0x08, 0x7F);            //IO3     [7]  SDO_TEN
                                    //        [6]  SPIPU
                                    //        [5:0]GIOPU
		spi_w(0x09, PKT1_CRCEN| PKT1_CRC8EN | DM1_AW);              //PKT1 
                                    //        [7:6]-
                                    //        [5]  CRC_EN   (00_CONFIG.3)
                                    //        [4]  CRC8_EN  (00_CONFIG.2)
                                    //        [1:0]AW- Sync words 01:3 Bytes  10:4 Bytes. 11:5 Bytes.

																		
    spi_w(0x0A, PKT2_WHT_EN|PKT2_WHT_SEED);              //PKT2    [7]  WHT_EN: Data whitening enable, [6:0]WHTSD[6:0]:Data whitening seed
		spi_w(0x0B, PKT3_WHT_PCF_EN|0x03);   //PKT3    [7]  WHT_PCF_EN  
																		//	 [5]- SKIP_PRE
																		//        [6:3]-
																		// 				[2:0]DLY_CONTI
    //spi_w(0x0C, 0x__);            //PKY4 [R]RXDLEN 

			spi_w(0x0D, 0x2C);            //PKT5    [7]-
                                    //        [6:4]DLY_RXS             0:4us, 1: 8us, 2:12us, 3:16us, 4:20us, 5:32us, 6: 64us, 7:100us
                                    //        [3:0]DLY_TXS            0: illegal, 1: 5us, 2: 10us, 3: 15us, 4: 20us, 5: 25us, 6: 30us, 7: 35us 8: 40us, 9: 50us, 10: 60us, 11: 70us, 12: 80us, 13: 90us, 14: 100us, 15: 120us
			spi_w(0x0E, 0x01);            //MOD1    DTR[7:0]    DTR[8:0]=0x001, Data Rate = Fxtal /32/(DTR+1) = 16000000 / (32*2) = 250K
			spi_w(0x0F, 0x1C);            //MOD2    [7:5]-      DTR_EN=0: then use setting DM1[2:0] MDIV_SEL,SDR
			                              //        [4]  DITHER_EN
                                    //        [3:2]DITHER
                                    //        [1]  DTR_EN
                                    //        [0]  DTR[8]
		  spi_w(0x10, RFCH_FRONTEND);       //RF_CH (05_RF_CH)
                                    //        [7]  -
                                    //        [6:0]RF_CH		
			spi_w(0x11, dm1_mdiv_sel|dm1_mdiv_sdr|dm1_d_rate);//DM1
                                    //        [7:6]MDIV_SEL
                                    //        [5:4]SDR
                                    //        [3] 
                                    //        [2:0]D_RATE      
																		
			spi_w(0x12, 0x20);          //DM2     [7:0]FD_HOLD  
			spi_w(0x13, 0x10);            //RT1 (04_SETUP_RETR)
                                    //        [7:4]ARD: auto retransmit delay
                                    //        [3:0]ARC: auto retransmit count			
      spi_w(0x14, 0x00);           //RT2 (08_OBSERVE_TX)(Read-Only)			
		 	spi_w(0x15, 0x00);            //CE      [7:1]-, [0]CE		
			spi_w(0x16, 0x1F);            //IO4     [4:0]GIOPU[10:6]		

//bank 0		
		spi_cmd0_20_set_register_bank(0);		
		spi_w(0x21, 0x00|AMBLE2);              //ATR1     
																		//				[6]  AMBLE2
																		//				[0]CRC_PASS [R]
		spi_w(0x27, 0x0A);              //RSSI1    RSSI_CTHD[3:0]			
  //spi_w(0x28, 0x__);              //RSSI2 (RO read only)
  //spi_w(0x29, 0x__);              //RSSI3 (RO read only)	
	
   if(DPL2_EN_DPL==0)
    spi_w(0x2A, 0x00);              //DPL1 (1C_DYNPD)
   else
    spi_w(0x2A, DPL_P5 | DPL_P4 | DPL_P3 | DPL_P2 | DPL_P1 | DPL_P0);    //DPL1 (1C_DYNPD)
                                    //        [7:6]-
                                    //        [5]  DPL_P5
                                    //        [4]  DPL_P4
                                    //        [3]  DPL_P3
                                    //        [2]  DPL_P2
                                    //        [1]  DPL_P1
                                    //        [0]  DPL_P0
	   spi_w(0x2B, DPL2_EN_INV_NOACK|DPL2_EN_DPL|DPL2_EN_ACK_PLD|DPL2_EN_DYN_ACK);  //DPL2 (1D_FEATURE)
																	//        [8]- INV_NOACK: 
                                    //        [7:3]-
                                    //        [2]  EN_DPL    : enable dynamic payload length
                                    //        [1]  EN_ACK_PLD: enable ack_packet with payload
                                    //        [0]  EN_DYN_ACK: enable W_TX_PAYLOAD_NOACK command													
    spi_w(0x2C, 0x01);              //RXPW0 (11_RX_PW_P0)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P0
    spi_w(0x2D, 0x08);              //RXPW1 (12_RX_PW_P1)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P1
    spi_w(0x2E, 0x10);              //RXPW2 (13_RX_PW_P2)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P2
    spi_w(0x2F, 0x18);              //RXPW3 (14_RX_PW_P3)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P3
    spi_w(0x30, 0x1C);              //RXPW4 (15_RX_PW_P4)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P4
    spi_w(0x31, 0x20);              //RXPW5 (16_RX_PW_P5)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P5
    spi_w(0x32, ENAA_P5 | ENAA_P4 | ENAA_P3 | ENAA_P2 | ENAA_P1 | ENAA_P0);		
		spi_w(0x33, 0x72);              //P2B0 (0C_RX_ADDR_P2)
                                    //        [7:0]P2B0
    spi_w(0x34, 0x73);              //P3B0 (0D_RX_ADDR_P3)
                                    //        [7:0]P3B0
    spi_w(0x35, 0x74);              //P4B0 (0E_RX_ADDR_P4)
                                   //        [7:0]P4B0
    spi_w(0x36, 0x75);              //P5B0 (0F_RX_ADDR_P5)
                                    //        [7:0]P5B0
	 #if   _HOST_TESTMODE_ == TRMODE_PTX
    spi_w(0x37, 0x01);              //DM4  (02_EN_RXADDR)
   #elif _HOST_TESTMODE_ == TRMODE_PRX
    spi_w(0x37, P5ACTIVE | P4ACTIVE | P3ACTIVE | P2ACTIVE | P1ACTIVE | P0ACTIVE); //DM4  (02_EN_RXADDR)
   #endif		
     spi_w(0x38, 0x10);              //XO1 duplicated bank2[0x3d]
                                    //        [7:6]XSHIFT
                                    //        [5]  XO_IL
                                    //        [4:0]XO_TRIM
     spi_w(0x39, 0x00);              //XO2 duplicated bank2[0x3e]
                                    //        [7:6]-
																		//				[5]XO_SW
                                    //        [4]  XO_SEL
                                    //        [3]  XODIV2
                                    //        [2:0]-
     spi_w(0x3A, 0xAF);              //TX2 duplicated bank2[0x34]
                                    //        [7:5]CT_VDD_PAD
                                    //        [4:3]CT_PRE_PAD
                                    //        [2:0]CT_DRV_PAD	 
		#if   DATARATE == 250
    spi_w(0x3C, 0x00);              //SAD1     [1:0]CPF_M
		#elif DATARATE == 1000
    spi_w(0x3C, 0x01);             //SAD1     [1:0]CPF_M
		#elif DATARATE == 2000
    spi_w(0x3C, 0x02);              //SAD1     [1:0]CPF_M
		#endif																
		spi_w(0x3D, 0x04);              //AGC5 
                                    //        [3]  MPT_0DB_EN
                                    //        [2:0]LB_OFFSET_SEL											

//bank 1
    spi_cmd0_20_set_register_bank(1);		
		spi_w(0x20, 0x08);              //AGC1    [1:0]AGC_CMP_THD[1:0]AGC comparison number threshold, 0:continuos AGC until SYNCWORD is detected, 1~3:comparison number thrshold
                                    //        [4:2]OFFSET_SEL[2:0]
                                    //        [6]AGC_TS
																		//				[7]YAVG_FSEL
	 spi_w(0x21, 0x74);              //AGC2
                                    //        [2:0]IFDET_OK_THD[2:0]: IF detection OK threshold
                                    //        [7:3]OFFSET
	  spi_w(0x22, 0x11);              //AGC3(RO read only)
                                    //        [2:0]AGC_ST[2:0]:AGC state machine's state, 0x7:AGC_complete
                                    //        [3]-
                                    //        [7:4]GAIN_SEL[2:0]:gain curve select
		#if   DATARATE == 250
			spi_w(0x23, 0x20);									//AGC4 GAIN_STB////////////////////
		#elif DATARATE == 1000
		  spi_w(0x23, 0x20);             //AGC4 GAIN_STB /////////////////   
		#elif DATARATE == 2000
			 spi_w(0x23, 0x20);           //AGC4  GAIN_STB////////////////
		#endif		


                                    //        [7:0]GAIN_STB[7:0]
    spi_w(0x24, 0x00);              //FCF1
                                    //        [7:4]MOD_INDEX2[3:0]
                                    //        [3:0]MOD_INDEX1[3:0]
		spi_w(0x25, 0x00);              //FCF2 // Datarate 250k    __Diviation:170k			
		//spi_w(0x25, 0x13);              //FCF2 // Datarate 250k    __Diviation:200k	
                                      //        [7:0]FSCALE[7:0]
																		
		spi_w(0x26, 0x40);  					//// Datarate 250k    __Diviation:170k
		//spi_w(0x26, 0x06);  					//// Datarate 250k    __Diviation:200k 
		spi_w(0x27, 0x00);             //FCF4
                                    //        [7]RXFD
                                    //        [6]-
																		//        [5]FMOD_TS
                                    //        [0]FSCALE[16]		
		spi_w(0x28, 0x42);							//SAR2: 
																		//[7]-
																		//[6]AD_ENC
																		//[5:2]-
																		//[1:0]AD_CLOS
																		
