WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
		spi_w(0x29, 0x04);	  					//SAD3:
																		//[7:5]AD_CR
																		//[4]AD_ROF
																		//[3]AD_CLOK
																		//[2:0]AD_CRW		
																		
	
				spi_w(0x2B, 0x02);					//for agc DAC_R_OW//////////////////////////////////////
		#if   DATARATE == 250
			spi_w(0x31, 0x04);   				  //DA8   
																		//[7:4]-
																		//[3]TPCDNK_BP
																		//[2]DAC_I_OW
																		//[1]-
																		//[0]DAC_EN						
		#elif DATARATE == 1000
		  	spi_w(0x31, 0x00);   				  //DA8                              
		#elif DATARATE == 2000
				spi_w(0x31, 0x00);   				  //DA8 
		#endif		
				spi_w(0x32, 0x00);						//DA9 [7:0]-DAC_I[7:0]
				spi_w(0x33, 0x02);   				  //DA10
				                              //[1:0]DAC_I[9:8]		
				spi_w(0x35, 0x03);   				  //AGC9 DBFS_OFFSET [2:0]		PDIFF_THDUPH [1:0]	AGC_TS_EN [1:0]	 
		
//bank 2
    spi_cmd0_20_set_register_bank(2);
		#if   DATARATE == 250
		spi_w(0x21, 0x57);              //RXG
                                    //        [1:0]GAIN_LNA[1:0] 00:ultralow gain, 01:low gain, 10:middle gain, 11:high gain
                                    //        [2]  GAIN_MX       0:low gain, 1:high gain
                                    //        [4:3]GAIN_BPF[1:0] 00:12dB, 01:18dB, 10:24dB, 11:24dB
                                    //        [7:5]GAIN_PGA[2:0] 000:0dB, 001:6dB, 010:12dB, 011:18dB, 100:24dB, 101:30dB, 110/111:36dB
		#elif DATARATE == 1000
			spi_w(0x21, 0x57); 

		#elif DATARATE == 2000
			spi_w(0x21, 0x77); 
		#endif	
		//spi_w(0x25, 0x20);//debug       //SX4     [5]  TX_MORE_EN=1
		spi_w(0x26, 0x00);              //CP1
																		//[7:6]CM
																		//[5:3]IB_OFFSET
																		//[2:1]PFD_DLY					
																		//[0]CP_EN
		#if   DATARATE == 250
		spi_w(0x27, 0xAA);              //CP2   v3[3:0]CX_M
                                    //        [7:4]IB_CP_M
		#elif DATARATE == 1000
			spi_w(0x27, 0x66); 
		#elif DATARATE == 2000
			spi_w(0x27, 0x66); 
		#endif

	 #if   DATARATE == 250
			spi_w(0x28, 0xA3);   				  //CP3     [0]  ALPF_EN
			                              //        [2:1]PZ
                                    //        [4:3]P3RD
                                    //        [7:5]DLY_SYN[2:0] 000:16us, 001:20us, 010:24us, 011:28us, 100:32us, 101:36us, 110:40us, 111:100us
		#elif DATARATE == 1000
		  spi_w(0x28, 0xA0);   				  //CP3     [0]  ALPF_EN                          
		#elif DATARATE == 2000
			spi_w(0x28, 0xA1);   				  //CP3     [0]  ALPF_EN
		#endif																

																		

		spi_w(0x29, 0x90);              //OD1     [5]  RESET_DSM: Reset DSM modulator 

		spi_w(0x2A, 0x11);			        //OD2     [7:6]DLY_SXPD   00:55us, 01:70us, 10:90us, 11:127us
    spi_w(0x2B, 0x12);              //VC1
		//spi_w(0x2C, 0x26);              //VC2
		spi_w(0x2D, 0x18);				       //VC3     [3:1]CT_VTMID=100  5602 v3 full mask (2019sept6 Jacky)
		spi_w(0x2E, 0xEC);              //RX1
    spi_w(0x2F, 0x56);              //RX2
    spi_w(0x30, 0x08);              //RX3
		spi_w(0x31, 0x20);              //RX4
		spi_w(0x32, 0x08);              //RX5
		spi_w(0x33, 0x14);			       //TX1     [0]  PAD_EN: TX PA driver enable
                                    //        [3:1]RAMP_DN   000:x  001:30u  010:40u  011:50u  100:65u  101:80u  110:100u  111:120u
                                    //        [6:4]RAMP_UP   000:x  001:25u  010:35u  011:45u  100:60u  101:75u  110: 95u  111:115u
                                    //        [7]-
		//spi_w(0x34, 0xFE);// 0dbm       //TX2 duplicated bank0[0x3F]
                                    //        [7:5]CT_VDD_PAD
                                    //        [4:3]CT_PRE_PAD
                                    //        [2:0]CT_DRV_PAD
		//spi_w(0x35, 0x0F);// 0dbm       //TX3     [7]-
                                    //        [6:4]IBP_PAD[2:0]
                                    //        [3:0]IBN_PAD[3:0]
		spi_w(0x34, 0xCF);// 7dbm       //TX2 duplicated bank0[0x3F]
		spi_w(0x35, 0x30);// 7dbm       //TX3     [7]-			
		//spi_w(0x34, 0x7D);// -5dbm       //TX2 duplicated bank0[0x3F]
		//spi_w(0x35, 0x0F);// -5dbm       //TX3     [7]-			
		spi_w(0x36, 0x03);              //TX4     [7:4]-
                                    //        [3]  PAD_OW
                                    //        [2:0]DLY_PAD, PAD delay. 000:6us  001:20us  010:30us  011:40us  100:55us  101:75us  110:100us  111:128us		
	//	spi_w(0x37, 0x50);              //CA1			
		spi_w(0x38, 0x20);              //CA2				#RC calibration manual setting  22 16
		spi_w(0x39, 0x90);              //CA3  		new[7]  FDCOC_EN
                                    //        [6:5]-
                                    //        [4:2]DLY_DCOCTB: DCOC turbo mode timing (switch RC) 000:0us, 001:2us, 010:4us, 011:5us, 100:6us, 101:7us, 110:8us, 111:10us
                                    //        [1]  DCOCTB_EN: DCOC turbo mode trigger as PWR_SOFT=1
                                    //        [0]  DCOC_ENB: RX DCOC (server loop) disable
		spi_w(0x3A, 0x54);              //LD1: SXLDO_EN[7:6]=01(1.5V),VCOLDO_EN[5:4]=01(1.5V),XOLDO[3:2]=01(1.5V)
		spi_w(0x3B, 0x54);							//LD2: DIG_LDO[7:6]=01(1.2V), IFLDO_EN[5:4]=01(1.5V),ADCLDO_EN[3:2]=01(1.5V)	  57
		spi_w(0x3C, 0x43);							//LD3: IB_BG[1:0]=2 LNALDO_EN[2:1]=01(1.5V) with Reg34=6F
		spi_w(0x3D, 0x10);							//XO1
		spi_w(0x3E, 0x02); 					  //XO2
                                    //        [7:5]-
                                    //        [4]  XO_SEL
                                    //        [3]  XODIV2
                                    //        [2:0]-
		//spi_w(0x3F, 0x00);							//RTM1
			
//bank 3
		spi_cmd0_20_set_register_bank(3);			
    spi_w(0x2C, 0x01);              //EFU2    [7:3]-
                                    //        [2:0] 
		spi_w(0x2D, 0x00);							//RFT1
		                                //        [6:4]  CPA 
                                    //        [2:0]  CMA 	
																

		spi_w(0x2E, 0x40);							//RFT1
		                                //        [6:4]  IB_PGA 
                                    //        [2:0]  CLA  						
	  #if   DATARATE == 250
			spi_w(0x2F, 0x18);   				  //TEST1				//Divation 170k
		                                //        [7]  DACFD_EN 
                                    //        [6]  MMDFD_EN  
		                                //        [4]  DLY_BPS_EN 
                                    //        [3]  DAC_DLY_EN  
                                    //        [2:0] DAC_DLY			
			//spi_w(0x2F, 0xD8);				//Diviation 200k																		
		#elif DATARATE == 1000
				spi_w(0x2F, 0x0E);  		 //TEST1	
		#elif DATARATE == 2000
			spi_w(0x2F, 0x0A);   				  //TEST1	
		#endif	
		
		//spi_w(0x30, 0x00);						//TXFD   DACFD_EN,   MMDFD_EN, DLY_BPS_EN=1=by pass delay,  DAC_DLY_EN(SEL),  DAC_DLY,  18(default)=No DAC delay,  08=MMD delay max.														
	
		spi_w(0x39, 0x40);   					//DM3 
		spi_w(0x3A, 0x00);						//DM4
                                  //        [0] STEP_EN	
	 #if   DATARATE == 250
			spi_w(0x3B, 0x1F);  					//AGC6 		ABORT TIME	
		#elif DATARATE == 1000
			spi_w(0x3B, 0x1F);					//AGC6      	ABORT TIME 			
		#elif DATARATE == 2000
			spi_w(0x3B, 0x00);						//AGC6	ABORT TIME	
		#endif

		                              //[4:0]ABORT_TIME 
		spi_w(0x33, 0x80|0x06);         			//TEST5  				
		
/////////////////////////////////  VCO Calibration 

//bank 2
    spi_cmd0_20_set_register_bank(2);
		spi_w(0x20, 0x08);              //OM	ACL_EN
    delay_unit_50us(2);

