WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
//////////////////////////////// 2-point
//bank 1
    spi_cmd0_20_set_register_bank(1);
		#if   DATARATE == 250
				spi_w(0x3D, 0x50);   				  //DA20 
			  spi_w(0x3E, 0x5D);						//DA21   
			  spi_w(0x2A, 0x34);  					//DA1    
		#elif DATARATE == 1000		
		  	spi_w(0x3D, 0xD7);   				  //DA20   
				spi_w(0x3E, 0x5D);
				spi_w(0x2A, 0x35); 	
				//uart_puts("1M");				
		#elif DATARATE == 2000
				spi_w(0x3D, 0x57);   				  //DA20
				spi_w(0x3E, 0x5D);
				spi_w(0x2A, 0x35);  	
		#endif
	 #if   _HOST_TESTMODE_ == TRMODE_PTX
    		uart_puts("PTX");
   #elif _HOST_TESTMODE_ == TRMODE_PRX
				uart_puts("PRX");
	 #endif
    while( (spi_r(0x2A)&0x01)==0x01 ) {;}	
		//delay_unit_50us(2);
////////////////////////////////		
		
		init_syncID();
//    test_read_chip_version();
//bank 0
    spi_cmd0_20_set_register_bank(0);																									
		  																
}

/*
static void init_2fpga(void)
{
    macroCSN_SELECT_FPGA;
    spi_cmd0_08_software_reset();
    spi_cmd0_0C_lightsleep();

    spi_w(0x00, CFG1_AGC_EN | 0x00);//CFG1
    //
  //spi_w(0x02, 0x00);              //RC2     [0]  TX_FULL (RO read only)
    spi_w(0x02, 0x30);              //RC2     [0]  TX_FULL (RO read only)
                                    //        [3:1]RX_P_NO (RO read only)
                                    //      v3[4]  PSAVE  Power saving mode control. XCLK's gating clock
                                    //      v3[5]  PSAVE1 Power saving mode control. XCLK's gating clock for RFCTRL
                                    //        [7:6]-
    spi_w(0x03, 0x7F);              //MASK (00_CONFIG) [7]-, [6]MASK_RX, [5]MASK_TX, [4]MASK_MAX_RT, [3]MASK_ADDRESS, [2]MASK_BCMATCH, [1]MASK_RX_TO, [0]PRIM_RX
                                    //        [7]  -
                                    //        [6]  MASK_RX
                                    //        [5]  MASK_TX
                                    //        [4]  MASK_MAX_RT
                                    //        [3]  MASK_ADDRESS
                                    //        [2]  MASK_BCMATCH
                                    //        [1]  MASK_RX_TO
                                    //        [0]  PRIM_RX

    spi_w(0x04, 0x7E);              //IRQ1 (07_STATUS) [7]-, [6]RX_DR,   [5]TX_DS,   [4]MAX_RT, [3]ADDRESS, [2]BCMATCH, [1]RX_TO, [0]-
                                    //        [7]  -
                                    //        [6]  RX_DR
                                    //        [5]  TX_DS
                                    //        [4]  MAX_RT
                                    //        [3]  ADDRESS
                                    //        [2]  BCMATCH
                                    //        [1]  RX_TO
                                    //        [0]  -
  //spi_w(0x05, 0x__);              //IRQ2 (17_FIFO_STATUS) (RO read only)
                                    //        [7]  -
                                    //        [6]  -        todo:TX_REUSE
                                    //        [5]  TX_FULL
                                    //        [4]  TX_EMPTY
                                    //        [3:2]-
                                    //        [1]  RX_FULL
                                    //        [0]  RX_EMPTY
  //spi_w(0x06, 0x00);              //PKT4 RO (strobe R_RX_PL_WID)
                                    //        [7:0](RO)RXDLEN
    spi_w(0x07, 0x00);              //RF_CH (05_RF_CH)
                                    //        [7]  -
                                    //        [6:0]RF_CH
    spi_w(0x08, 0xF0);              //RT1 (04_SETUP_RETR)
                                    //        [7:4]ARD: auto retransmit delay
                                    //        [3:0]ARC: auto retransmit count
  //spi_w(0x09, 0x__);              //RT2 (08_OBSERVE_TX)(Read-Only)
                                    //        [7:4](RO)CNT_PLOS
                                    //        [3:0](RO)CNT_ARC
    spi_w(0x0A, 0x00);              //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE
    spi_w(0x0B, 0x03);              //HB4
    spi_w(0x0C, 0x06);              //HB5
  //spi_w(0x0D, 0x__);              //WL0
  if(dpl2_en_dpl==0)
    spi_w(0x0E, 0x00);              //DPL1 (1C_DYNPD)
  else
    spi_w(0x0E, DPL_P5 | DPL_P4 | DPL_P3 | DPL_P2 | DPL_P1 | DPL_P0);    //DPL1 (1C_DYNPD)
                                    //        [7:6]-
                                    //        [5]  DPL_P5
                                    //        [4]  DPL_P4
                                    //        [3]  DPL_P3
                                    //        [2]  DPL_P2
                                    //        [1]  DPL_P1
                                    //        [0]  DPL_P0
    spi_w(0x0F, en_inv_noack|dpl2_en_dpl|dpl2_en_ack_pld|dpl2_en_dyn_ack);  //DPL2 (1D_FEATURE)
                                    //        [7]  INV_NOACK
                                    //        [6:3]-
                                    //        [2]  EN_DPL    : enable dynamic payload length
                                    //        [1]  EN_ACK_PLD: enable ack_packet with payload
                                    //        [0]  EN_DYN_ACK: enable W_TX_PAYLOAD_NOACK command
    spi_w(0x10, 0x01);              //RXPW0 (11_RX_PW_P0)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P0
    spi_w(0x11, 0x02);              //RXPW1 (12_RX_PW_P1)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P1
    spi_w(0x12, 0x0B);              //RXPW2 (13_RX_PW_P2)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P2
    spi_w(0x13, 0x16);              //RXPW3 (14_RX_PW_P3)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P3
    spi_w(0x14, 0x1F);              //RXPW4 (15_RX_PW_P4)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P4
    spi_w(0x15, 0x20);              //RXPW5 (16_RX_PW_P5)
                                    //        [7:6]-
                                    //        [5:0]RX_PW_P5
    spi_w(0x16, ENAA_P5 | ENAA_P4 | ENAA_P3 | ENAA_P2 | ENAA_P1 | ENAA_P0);
                                    //ENAA (01_EN_AA)
                                    //        [7:6]-
                                    //        [5]  ENAA_P5
                                    //        [4]  ENAA_P4
                                    //        [3]  ENAA_P3
                                    //        [2]  ENAA_P2
                                    //        [1]  ENAA_P1
                                    //        [0]  ENAA_P0
                                    //____ (10_TX_ADDR)    replaced by strobe command 0x10:write syncword PTX(PTX only use Pipe 0)
                                    //                                                0x91:read  syncword PTX(PTX only use Pipe 0)
                                    //P0__ (0A_RX_ADDR_P0) replaced by strobe command 0x10:write syncword P0
                                    //                                                0x91:read  syncword P0
                                    //P1__ (0B_RX_ADDR_P1) replaced by strobe command 0x12:write syncword P1
                                    //                                                0x92:read  syncword P2
    spi_w(0x17, 0x72);              //P2B0 (0C_RX_ADDR_P2)
                                    //        [7:0]P2B0
    spi_w(0x18, 0x73);              //P3B0 (0D_RX_ADDR_P3)
                                    //        [7:0]P3B0
    spi_w(0x19, 0x74);              //P4B0 (0E_RX_ADDR_P4)
                                    //        [7:0]P4B0
    spi_w(0x1A, 0x75);              //P5B0 (0F_RX_ADDR_P5)
                                    //        [7:0]P5B0

//bank 0
    spi_cmd0_20_set_register_bank(0);
  //spi_w(0x20, 0x__);              //OM
    spi_w(0x21, 0x0F);              //DM0     [6]  AMBLE2
    spi_w(0x22, 0xA0|dm1_aw|dm1_d_rate); //DM1
                                    //DM1     [7:4]RSSI_CTHD  RSSI threshold for carrier detection
                                    //        [3:2]AW   11:5, 10:4, 01:3, 00:-      (03_SETUP_AW[1:0])
                                    //        [1:0]D_RATE     00:250 kbps, 01:1 Mbps

    spi_w(0x23, 0x08);              //DM2     [7:0]FD_HOLD
		spi_w(0x24, 0x80);//default 80  //DM3     [7:0]PHASE_DSTEP


   #if   _HOST_TESTMODE_ == TRMODE_PTX
    spi_w(0x25, 0x01);              //DM4  (02_EN_RXADDR)
   #elif _HOST_TESTMODE_ == TRMODE_PRX
    spi_w(0x25, P5ACTIVE | P4ACTIVE | P3ACTIVE | P2ACTIVE | P1ACTIVE | P0ACTIVE); //DM4  (02_EN_RXADDR)
   #endif
                                    //        [7:6]-
                                    //        [5]  P5ACTIVE
                                    //        [4]  P4ACTIVE
                                    //        [3]  P3ACTIVE
                                    //        [2]  P2ACTIVE
                                    //        [1]  P1ACTIVE
                                    //        [0]  P0ACTIVE
  //spi_w(0x26, 0x__);              //STA1
                                    //        [7]  CD_FLAG Carrier Detection flag
                                    //        [6:3]-
                                    //        [2:0]OMST
  //spi_w(0x27, 0x__);              //RSSI2 (RO read only)
  //spi_w(0x28, 0x__);              //RSSI3 (RO read only)
    spi_w(0x29, pkt1_crc_sync | pkt1_crclength); //PKT1 (00_CONFIG.3.2)
                                    //        [7]  CRC_ADD_EN:    0:sync not include, 1:sync include
                                    //        [6]  CRC_TEST       Enable TX test format, CRC is 0x555555 for LE RF-PHY conformance testing using Direct Test Mode
                                    //        [5:2]-
                                    //        [1:0]CRC_LENGTH   00:disabled, 01:CRC8, 10:CRC16, 11:CRC24
    spi_w(0x2A, pkt2_wht_en|PKT2_WHT_SEED);
                                    //PKT2    [7]  WHT_EN: Data whitening enable, [6:0]WHTSD[6:0]:Data whitening seed
    spi_w(0x2B, PKT3_WHT_PCF_EN|(0<<3)|0x03);//PKT3    [7]  WHT_PCF_EN
                                    //        [6:3]DLY_TIFS  add delay in us, Rx to Tx , switch time is DLY_TXS + DLY_TIFS
                                    //        [2:0]DLY_CONTI RF continue mode delay time  TX: 0:8uS, 1:16uS, 2:32uS, 3:64uS, 4:96uS, 5:128uS, 6:192uS, 7:256uS
                                    //                                                    RX: 0:1uS, 1: 4uS, 2: 8uS, 3:12uS, 4:16uS, 5: 24uS, 6: 40uS, 7:128uS
    spi_w(0x2C, 0x01);              //PKT5    [7]-
                                    //        [6:4]DLY_RXS             0:4us, 1: 8us, 2:12us, 3:16us, 4:20us, 5:32us, 6: 64us, 7:100us
                                    //        [3]- 
                                    //        [2:0]DLY_TXS             0:40us,1:50us, 2:60us, 3:70us, 4:80us, 5:90us, 6:100us, 7:120us
  #if   PKT1_CRCLEN == 0x01
    spi_w(0x2D, 0x07);              //CRC1        CRC8  = X^8 + X^2 + X + 1
  #elif PKT1_CRCLEN == 0x02
    spi_w(0x2D, 0x21);              //CRC1        CRC16 = X^16 + X^12 + X^5 + 1
    spi_w(0x2E, 0x10);              //CRC2
  #elif PKT1_CRCLEN == 0x03
    spi_w(0x2D, 0x5B);              //CRC1        CRC24  x24 + x10 + x9 + x6 + x4 + x3 + x + 1
    spi_w(0x2E, 0x06);              //CRC2
    spi_w(0x2F, 0x00);              //CRC3
  #endif
    spi_w(0x30, 0xFF);              //CRC4 CRC_INI[23:16] CRC initial value 
    spi_w(0x31, 0xFF);              //CRC5 CRC_INI[15: 8] CRC initial value 
    spi_w(0x32, 0xFF);              //CRC6 CRC_INI[ 7: 0] CRC initial value 

//bank 1
    spi_cmd0_20_set_register_bank(1);
    spi_w(0x20, 0x04);              //AGC1    [1:0]AGC_CMP_THD[1:0]AGC comparison number threshold, 0:continuos AGC until SYNCWORD is detected, 1~3:comparison number thrshold
                                    //        [4:2]OFFSET_SEL[2:0]
                                    //        [7:5]-
    spi_w(0x21, 0x23);              //AGC2
                                    //        [2:0]IFDET_OK_THD[2:0]: IF detection OK threshold
                                    //      v3[7:3]OFFSET
  //spi_w(0x22, 0x__);              //AGC3(RO read only)
                                    //        [2:0]AGC_ST[2:0]:AGC state machine's state, 0x7:AGC_complete
                                    //        [3]-
                                    //        [7:4]GAIN_SEL[2:0]:gain curve select
    spi_w(0x23, 0x10);              //AGC4

                                    //        [7:0]GAIN_STB[7:0]
   // spi_w(0x24, 0x03);              //FCF1
                                    //        [7:4]MOD_INDEX2[3:0]
                                    //        [3:0]MOD_INDEX1[3:0]
//  spi_w(0x25, 0x44);              //FCF2

