WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
                                    //        [7:0]FSCALE[7:0]

//    spi_w(0x26, 0x1C);//IF 600K 32M xtal //FCF3        RX's Fscale(change IF) = IF * 2^20 / (2 * Fxtal) = (600000 * 2^20)/(2*32000000) =  9830.4    9830=0x2666   1CCC
                                    //        [7]-
                                    //        [6:0]FSCALE[14:8]
//    spi_w(0x27, 0x00);              //FCF4
                                    //        [7]RXFD_EN
                                    //        [6]TXFD_EN
                                    //        [5:0]-

//bank 2
    spi_cmd0_20_set_register_bank(2);
    spi_w(0x21, 0x77);              //RXG
                                    //        [1:0]GAIN_LNA[1:0] 00:ultralow gain, 01:low gain, 10:middle gain, 11:high gain
                                    //        [2]  GAIN_MX       0:low gain, 1:high gain
                                    //        [4:3]GAIN_BPF[1:0] 00:12dB, 01:18dB, 10:24dB, 11:24dB
                                    //        [7:5]GAIN_PGA[2:0] 000:0dB, 001:6dB, 010:12dB, 011:18dB, 100:24dB, 101:30dB, 110/111:36dB
  //spi_w(0x25, 0x20);//debug       //SX4     [5]  TX_MORE_EN=1
//    spi_w(0x26, 0xC1);              //CP1
//    spi_w(0x27, 0xFF);              //CP2   v3[3:0]CX_M
                                    //        [7:4]IB_CP_M
    spi_w(0x28, 0x01);              //CP3     [0]  ALPF_EN
                                    //        [2:1]PZ
                                    //        [4:3]P3RD
                                    //        [7:5]DLY_SYN[2:0] 000:16us, 001:20us, 010:24us, 011:28us, 100:32us, 101:36us, 110:40us, 111:100us
    spi_w(0x29, 0x03);              //OD1     [5]  RESET_DSM: Reset DSM modulator

    spi_w(0x2A, 0x01);//debug       //OD2     [7:6]DLY_SXPD   00:55us, 01:70us, 10:90us, 11:127us
    spi_w(0x2B, 0x03);              //VC1

    spi_w(0x2D, 0x18);//5602 v3     //VC3     [3:1]CT_VTMID=100  5602 v3 full mask (2019sept6 Jacky)
    spi_w(0x2E, 0xEF);              //RX1
    spi_w(0x2F, 0x5A);              //RX2
    spi_w(0x30, 0x0B);              //RX3
    spi_w(0x31, 0x07);              //RX4
  //spi_w(0x32, 0x08);              //RX5

    spi_w(0x33, 0x50);//debug       //TX1     [0]  PAD_EN: TX PA driver enable
                                    //        [3:1]RAMP_DN   000:x  001:30u  010:40u  011:50u  100:65u  101:80u  110:100u  111:120u
                                    //        [6:4]RAMP_UP   000:x  001:25u  010:35u  011:45u  100:60u  101:75u  110: 95u  111:115u
                                    //        [7]-
    spi_w(0x34, 0x63);// 0dbm       //TX2 duplicated bank0[0x3F]
                                    //        [7:5]CT_VDD_PAD
                                    //        [4:3]CT_PRE_PAD
                                    //        [2:0]CT_DRV_PAD
    spi_w(0x35, 0x21);// 0dbm       //TX3     [7]-
                                    //        [6:4]IBP_PAD[2:0]
                                    //        [3:0]IBN_PAD[3:0]

    spi_w(0x36, 0x05);              //TX4     [7:4]-
                                    //        [3]  PAD_OW
                                    //        [2:0]DLY_PAD, PAD delay. 000:6us  001:20us  010:30us  011:40us  100:55us  101:75us  110:100us  111:128us
    spi_w(0x37, 0x10);              //CA1
  //spi_w(0x37, 0x90);//calibrate   //CA1
                                    //        [7]  RTXAC_EN: RX/TX auto calibration enables. 0: disable, 1: auto calibration before each TX/RX packet
                                    //        [6:5]-
                                    //        [4:2]DLY_VCOCAL: Delay time for VCO calibration module, 000:1us, 001:2us, 010:3us, 011:4us, 100:5us, 101:6us, 110:7us, 111:20us
                                    //        [1]  CALBUF_EN: 
                                    //        [0]  VCOCAL_EN: VCO calibration module enable
    spi_w(0x38, 0x0A);              //CA2
    spi_w(0x39, 0x12);              //CA3  new[7]  FDCOC_EN
                                    //        [6:5]-
                                    //        [4:2]DLY_DCOCTB: DCOC turbo mode timing (switch RC) 000:0us, 001:2us, 010:4us, 011:5us, 100:6us, 101:7us, 110:8us, 111:10us
                                    //        [1]  DCOCTB_EN: DCOC turbo mode trigger as PWR_SOFT=1
                                    //        [0]  DCOC_ENB: RX DCOC (server loop) disable
  //spi_w(0x3D, 0x30);              //XO1 duplicated bank0[0x3d]
                                    //        [7:6]XSHIFT
                                    //        [5]  XO_IL
                                    //        [4:0]XO_TRIM

    spi_w(0x3E, 0x00); // may06     //XO2

                                    //        [7:5]-
                                    //        [4]  XO_SEL
                                    //        [3]  XODIV2
                                    //        [2:0]-

//bank 3
    spi_cmd0_20_set_register_bank(3);
    spi_w(0x20, 0x80|0x05);         //IO1     [5:3]GIO2S[2:0]=0h:-     , [2:0]GIO1S[2:0]=0h:-      , [7:6]PADDS[1:0] PAD drive strength:0:0.5mA,1:1mA,2:5mA,3:10mA
  #if   _SPI_WIRES_ == 3
    spi_w(0x21, 0x00);              //IO2     [7:4]GIO4S[3:0]=5h:IRQ3  , [3:0]GIO3S[3:0]=0h:-
  #elif _SPI_WIRES_ == 4
    spi_w(0x21, 0x10);//4-wire SPI  //IO2     [7:4]GIO4S[3:0]=5h:IRQ3  , [3:0]GIO3S[3:0]=0h:-
  #endif
	
		
		spi_w(0x31, 0x04);              //LB_OFFSET_SEL	
		spi_w(0x36, 0x47);              //YAVG_FSEL=0; GAIN_MSWT;1'B0;ABORT=7us   
		spi_w(0x33, 0x50);              //PDIFF_THD
		spi_w(0x38, 0x14);              //GCV1_RSTHD	
		
    spi_w(0x26, 0x80|0x03);         //TEST4  de-modulator   GIO[5:0] = {ID_MATCH_OK(out),RBCLK(out),BDATA_OUT(out),CGATE_EN(out),DEMOD_EN(out), SAMPLE_EN(out)}

    spi_w(0x2B, 0x02);              //MOD1    DTR[7:0]    DTR[8:0]=0x001, Data Rate = Fxtal /32/(DTR+1) = 16000000 / (32*2) = 250K
    spi_w(0x2C, 0x00);              //MOD2    [7:5]-
                                    //        [4]  DITHER_EN
                                    //        [3:2]DITHER
                                    //        [1]  DTR_EN
                                    //        [0]  DTR[8]
  __read_fpga_all_ctrl_registers();
//  __check_v1_all_ctrl_registers();

    init_syncID();
   // test_read_chip_version();
//bank 0
    spi_cmd0_20_set_register_bank(0);
}
*/
#define ST_0                           0x0000
/**
 *  @ingroup BC3601_Host_FSM1_private_by_Holtek_label
 */
static void init_mcu(void)
{
    //GPIO for software SPI usage
    init_softspi();

    //GPIO <--- IRQ3
    init_GPIO_IRQ3();
    
