WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
    //GPIO debug usage
    set_PE_OUTPUT_MDOE();

    hfsm1.trmode=0;
    hfsm1.state=ST_0;
    spiTxQ.status = SPITXQ_STATUS_EMPTY;
}
/**
 *  @ingroup BC3601_Host_FSM1_private_by_Holtek_label
 */

static void init_5602(void)
{
	write_PE0_RESET_0;
	write_PE0_SET_1;
	write_PE0_RESET_0;
	write_PE0_SET_1;
	write_PE0_RESET_0;
		init_5603_v4_sz_ic_20230615();
//init_5602_fifomode();
}

////////////////////////////////////////

static void read_rt2_upon_txds(void)
{
    unsigned char rt1, rt2;
    rt1 = spi_r(0x08);         // RT1
    rt2 = spi_r(0x09);         // RT2
uart_puts("RT1="); uart_putu8(rt1); uart_puts("  TX_DS   RT2="); uart_putu8(rt2); uart_putchar_n('\n');
}
static void read_rt2_upon_maxrt(void)
{
    unsigned char rt1, rt2;
    rt1 = spi_r(0x08);         // RT1
    rt2 = spi_r(0x09);         // RT2
uart_puts("RT1="); uart_putu8(rt1); uart_puts("  MAX_RT  RT2="); uart_putu8(rt2); uart_putchar_n('\n');
}

////////////////////////////////////////
#define ST_PTX_SETTING              0x0400
#define ST_PTX_ENTRY_MIDDLE         0x0401
#define ST_PTX_MIDDLE_SLEEP         0x0402
#define ST_PTX_LIGHT_SLEEP          0x0403
#define ST_PTX_W4_TXCOMPLETE        0x0404
#define ST_PTX___________           0x0405
#define ST_PTX_MAXRT_DELAY_BEFORE_NEXT_TRANS 0x0406
#ifdef _CODE_TRMODE_PTX_
/**
 *  @ingroup BC3601_Host_FSM1_public_by_Holtek_label
 */
void entry_hfsm1_ptx(void)
{
    hfsm1.trmode = TRMODE_PTX ;
    hfsm1.state = ST_0;
}
/**
 *  @ingroup BC3601_Host_FSM1_public_by_Holtek_label
 */
void exit_hfsm1_ptx(void)
{
    spi_cmd0_0C_lightsleep();    //exit
    hfsm1.trmode = 0;
    hfsm1.state = ST_0;
}
/**
 *  @ingroup BC3601_Host_FSM1_private_by_Holtek_label
 */
static void change_syncword_ptxPipe0_to_prxPipeYouwant(unsigned char pipe)
{
    if     (pipe==0) {spi_cmdd_10_write_pipe_0_ID(syncID_p0);}
    else if(pipe==1) {spi_cmdd_10_write_pipe_0_ID(syncID_p1);}
    else if(pipe==2) {spi_cmdd_10_write_pipe_0_ID(syncID_p2);}
    else if(pipe==3) {spi_cmdd_10_write_pipe_0_ID(syncID_p3);}
    else if(pipe==4) {spi_cmdd_10_write_pipe_0_ID(syncID_p4);}
    else if(pipe==5) {spi_cmdd_10_write_pipe_0_ID(syncID_p5);}
}
/* static void change_amble2(void)  //preamble length 1 or 2 bytes
{
    static unsigned char zzz;
//bank 0
    spi_cmd0_20_set_register_bank(0);
    if((zzz++)&0x01)
    spi_w(0x61, 0x4F);              //CFO1    [6]  AMBLE2
    else
    spi_w(0x61, 0x0F);              //CFO1    [6]  AMBLE2
}*/
static void debug_rxpackets_from_prx_not_consecutive(unsigned char len, unsigned char *pPayload)
{
    static unsigned char expected_length_from_prx;
    static unsigned char expected_payload_0_from_prx;
    unsigned char i;
    bool isCorrectPayload = TRUE;
    for(i=0; i<len; i++) {
        if( pPayload[i] != ((expected_payload_0_from_prx+i)&0xFF) ) isCorrectPayload=FALSE;
    }
    if (expected_length_from_prx != len  ||
                isCorrectPayload != TRUE )
    {
        uart_puts("ERROR !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! "); uart_putchar_n('\n');uart_putchar_n('\n');uart_putchar_n('\n');
    }
    expected_length_from_prx = len+1;
    if(expected_length_from_prx>32) {expected_length_from_prx=1;}
    expected_payload_0_from_prx = pPayload[0]+1;
}
#define TX_MIDSLEEP     0
#define TX_METHOD_CE    0  // 0: CE=0
                           // 1: CE=1
static void host5602_fsm1_ptx(void)
{
    unsigned char r_irq1, r_irq2;
    switch(hfsm1.state)
    {
    case ST_PTX_SETTING:
									
                spi_w(0x03, 0x80|0x00);             //MASK CONFIG [7]-, [6]MASK_RX, [5]MASK_TX, [4]MASK_MAX_RT, [3]MASK_ADDRESS, [2]MASK_BCMATCH, [1]MASK_RX_TO, [0]PRIM_RX=0:PTX
                spi_clear_irq1();
                spi_w(0x15, 0x00);                  //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE
                spi_cmd0_20_set_register_bank(0);

                #if 1
                spi_w(0x37, 0x01);                  //DM4  (02_EN_RXADDR)
                #else
                spi_w(0x37, P5ACTIVE | P4ACTIVE | P3ACTIVE | P2ACTIVE | P1ACTIVE | P0ACTIVE); //DM4  (02_EN_RXADDR)
                #endif
               #if TX_MIDSLEEP == 1
                hfsm1.state = ST_PTX_ENTRY_MIDDLE;
               #else
                hfsm1.state = ST_PTX_LIGHT_SLEEP;
               #endif
        break;
    case ST_PTX_ENTRY_MIDDLE:
                spi_w(0x15, 0x00);                  //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE
                spi_cmd0_0F_middlesleep();
                hfsm1.delay_offset = tmr50usGetCurrentTicks();
                hfsm1.state = ST_PTX_MIDDLE_SLEEP;
spi_cmd0_20_set_register_bank(0);
while( (spi_r(0x26)&0x07)!=0x01 ) {;}
spi_read_sta1_omst();
        break;
    case ST_PTX_MIDDLE_SLEEP:
                if(tmr50usIsExpired(hfsm1.delay_offset,  MIDDLE_SLEEP_TIME_UNIT_50US))
                {
                    spi_cmd0_0C_lightsleep();
spi_cmd0_20_set_register_bank(0);
while( (spi_r(0x26)&0x07)!=0x02 ) {;}
spi_read_sta1_omst();
                    hfsm1.state = ST_PTX_LIGHT_SLEEP;
                }
        break;
    case ST_PTX_LIGHT_SLEEP:
            if( !(spi_read_fifostatus()&0x20) )  // not TX_FULL
            {
                if( !(spi_read_fifostatus()&0x20) ) { // not TX_FULL
                    movedata_to_spiTxQ___ptx(1);
                change_syncword_ptxPipe0_to_prxPipeYouwant(spiTxQ.remote_pipe_no);
								//change_amble2();
								#if TX_NOACK_PKT == 0x11
                    if     (spiTxQ.remote_pipe_no==0) {movedata_spiTxQ_to_ptx_txfifo(0x11);}//0x13: test pipe 0 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==1) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==2) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==3) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==4) {movedata_spiTxQ_to_ptx_txfifo(0x11);}//0x13: test pipe 4 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==5) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
								#else
										if     (spiTxQ.remote_pipe_no==0) {movedata_spiTxQ_to_ptx_txfifo(0x13);}//0x13: test pipe 0 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==1) {movedata_spiTxQ_to_ptx_txfifo(0x13);}
                    else if(spiTxQ.remote_pipe_no==2) {movedata_spiTxQ_to_ptx_txfifo(0x13);}
                    else if(spiTxQ.remote_pipe_no==3) {movedata_spiTxQ_to_ptx_txfifo(0x13);}
                    else if(spiTxQ.remote_pipe_no==4) {movedata_spiTxQ_to_ptx_txfifo(0x13);}//0x13: test pipe 4 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==5) {movedata_spiTxQ_to_ptx_txfifo(0x13);}
								#endif
								}
                #if 0
                if( !(spi_read_fifostatus()&0x20) ) { // not TX_FULL
                    movedata_to_spiTxQ___ptx(0);
                    if     (spiTxQ.remote_pipe_no==0) {movedata_spiTxQ_to_ptx_txfifo(0x13);} // test 0x13: pipe 0 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==1) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==2) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==3) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==4) {movedata_spiTxQ_to_ptx_txfifo(0x11);} // test 0x13: pipe 4 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==5) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                }
                if( !(spi_read_fifostatus()&0x20) ) { // not TX_FULL
                    movedata_to_spiTxQ___ptx(0);
                    if     (spiTxQ.remote_pipe_no==0) {movedata_spiTxQ_to_ptx_txfifo(0x13);} // test 0x13: pipe 0 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==1) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==2) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==3) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==4) {movedata_spiTxQ_to_ptx_txfifo(0x11);} // test 0x13: pipe 4 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==5) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                }
                if( !(spi_read_fifostatus()&0x20) ) { // not TX_FULL
                    movedata_to_spiTxQ___ptx(0);
                    if     (spiTxQ.remote_pipe_no==0) {movedata_spiTxQ_to_ptx_txfifo(0x13);} // test 0x13: pipe 0 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==1) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==2) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==3) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==4) {movedata_spiTxQ_to_ptx_txfifo(0x11);} // test 0x13: pipe 4 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==5) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                }
                if( !(spi_read_fifostatus()&0x20) ) { // not TX_FULL
                    movedata_to_spiTxQ___ptx(0);
                    if     (spiTxQ.remote_pipe_no==0) {movedata_spiTxQ_to_ptx_txfifo(0x13);} // test 0x13: pipe 0 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==1) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==2) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==3) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==4) {movedata_spiTxQ_to_ptx_txfifo(0x11);} // test 0x13: pipe 4 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==5) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                }
                if( !(spi_read_fifostatus()&0x20) ) { // not TX_FULL
                    movedata_to_spiTxQ___ptx(0);
                    if     (spiTxQ.remote_pipe_no==0) {movedata_spiTxQ_to_ptx_txfifo(0x13);} // test 0x13: pipe 0 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==1) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==2) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==3) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                    else if(spiTxQ.remote_pipe_no==4) {movedata_spiTxQ_to_ptx_txfifo(0x11);} // test 0x13: pipe 4 as broadcast no_ack=1
                    else if(spiTxQ.remote_pipe_no==5) {movedata_spiTxQ_to_ptx_txfifo(0x11);}
                }				
								
								#endif
r_irq2 = spi_read_fifostatus();
//uart_puts("r_irq2="); uart_putu8(r_irq2); uart_puts("  "); uart_putchar_n('\n');
                #if  TX_METHOD_CE == 0 
                //spi_w(0x15, 0x00);                  //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE
								uart_puts("strobe tx");
								if(debug_i < TX_PKT_CNT){
									
                spi_cmd0_0E_TX();
								debug_i++;
								}
                #elif TX_METHOD_CE == 1 
                spi_w(0x15, 0x01);                  //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE
                //no need to spi_cmd0_0E_TX()
                #endif
                spi_cmd0_20_set_register_bank(0);
								uart_puts("333");
                while( (spi_r(0x26)&0x07)!=0x04 ) {;}       // STA1  [2:0]OMST 0:Deep Sleep Mode, 2:Light Sleep Mode, 4:TX Mode, 5: RX Mode, 6:Calibration mode
								uart_puts("444");
									hfsm1.state = ST_PTX_W4_TXCOMPLETE;
            }
        break;
    case ST_PTX_W4_TXCOMPLETE:
            if (GPIO_IRQ3_IS_RESET())
            {
								uart_puts("rssi= ");uart_putu8(spi_r(0x29)); //uart_putchar_n('\n');
                r_irq1 = spi_read_n_clear_irq1();
								//uart_putu8(r_irq1);
                if( r_irq1 & 0x10 ) {                   //[4]MAX_RT: transaction FAIL
											#if 1
											spi_cmd0_09_txfifo_flush();
											movedata_to_spiTxQ___ptx(1);
											change_syncword_ptxPipe0_to_prxPipeYouwant(spiTxQ.remote_pipe_no);
											movedata_spiTxQ_to_ptx_txfifo(0x11);
											#endif
											
											debug_MAX_RT++;
									uart_puts("RT:");uart_putu16(debug_i);uart_puts("  MAX_RT:");uart_putu16(debug_MAX_RT);uart_puts("  TX_DS:");uart_putu16(debug_TX_DS);uart_puts("  RT2:");uart_putu8(spi_r(0x14));uart_putchar_n('\n');			
//read_rt2_upon_maxrt();

                    #if   TX_METHOD_CE == 0 
                        #if 1 //debug
                        hfsm1.delay_offset = tmr50usGetCurrentTicks();
                        hfsm1.state = ST_PTX_MAXRT_DELAY_BEFORE_NEXT_TRANS;
                        #else
										if(debug_i<TX_PKT_CNT){
											//spi_cmd0_09_txfifo_flush();

                    spi_cmd0_0E_TX();
										debug_i++;}
                        #endif
                    #elif TX_METHOD_CE == 1 
                    //no need to spi_cmd0_0E_TX()
                    #endif
                }
                if( r_irq1 & 0x20 ) {                   //[5]TX_DS: transaction SUCCESSFUL
									debug_TX_DS++;
									uart_puts("RT:");uart_putu16(debug_i);uart_puts("  MAX_RT:");uart_putu16(debug_MAX_RT);uart_puts("  TX_DS:");uart_putu16(debug_TX_DS);uart_putchar_n('\n');			
//read_rt2_upon_txds();

if(spi_read_fifostatus()&0x10) { // [4]TX_EMPTY
                    spiTxQ.status = SPITXQ_TX_COMPLETE;
                    spi_w(0x15, 0x00);                  //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE
                   #if TX_MIDSLEEP == 1
                    hfsm1.state = ST_PTX_ENTRY_MIDDLE;
                   #else
                    hfsm1.delay_offset = tmr50usGetCurrentTicks();
                    hfsm1.state = ST_PTX___________;
                   #endif
}
else {
                    #if   TX_METHOD_CE == 0 
                    if(debug_i<TX_PKT_CNT){
                    spi_cmd0_0E_TX();
										debug_i++;}                   // trigger next transaction
                                                        // the txfifo is still occupied. MAX_RT does not clear txfifo
										
                    #elif TX_METHOD_CE == 1 
                    //no need to spi_cmd0_0E_TX(), 5602 automatically trigger next transaction
                    #endif
}
                }
                if( r_irq1 & 0x40 ) {                   //[6]RX_DR: roger an ack_payload
               #if TX_MIDSLEEP == 0 // midsleep would clear rxfifo content
            //    if   (   spi_read_fifostatus() & 0x02  ) { // RX_FULL    test: wait RX_FULL then read
               #endif
                while( !(spi_read_fifostatus() & 0x01) ) { // RX_EMPTY
                    spi_read_rxfifo_to_spiRxQ();
                   // debug_rxpackets_from_prx_not_consecutive(spiRxQ.w_index, spiRxQ.payload+0);
                  //debug_print_rssi();
									uart_puts("zzz_pipe="); uart_putu8(spiTxQ.remote_pipe_no); uart_puts("  "); //uart_putchar_n('\n');
                    callback_spiRxQ_process_at_hfsm2();
                }
               #if TX_MIDSLEEP == 0
            //    }
               #endif
                }
            }
        break;
    case ST_PTX___________:
              //if(tmr50usIsExpired(hfsm1.delay_offset, 20000))  // debug
              //if(tmr50usIsExpired(hfsm1.delay_offset,  500))  // debug
               if(tmr50usIsExpired(hfsm1.delay_offset,  200))  // debug
              //if(tmr50usIsExpired(hfsm1.delay_offset,   2000))  // debug
                {
										debug_i=1;
                    hfsm1.state = ST_PTX_LIGHT_SLEEP;
                }
            break;
    case ST_PTX_MAXRT_DELAY_BEFORE_NEXT_TRANS:
              //  if(tmr50usIsExpired(hfsm1.delay_offset, 200))  // debug
              //if(tmr50usIsExpired(hfsm1.delay_offset,  500))  // debug
              if(tmr50usIsExpired(hfsm1.delay_offset,   200))  // debug
                {
                    if(debug_i<1000){
                    spi_cmd0_0E_TX();
										debug_i++;}                   // trigger next transaction
                                                        // the txfifo is still occupied. MAX_RT does not clear txfifo
                    hfsm1.state = ST_PTX_W4_TXCOMPLETE;
                }
            break;
    }
}
#endif


