WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
////////////////////////////////////////
#define ST_PRX_SETTING                0x0500
#define ST_PRX_SET_ING                0x0501
#define ST_PRX_W4_RXCOMPLETE          0x0502
#define ST_PRX_TEST_CE_0_AT_ANYTIME   0x0503  // test CE=0 && switch role to ptx
#define ST_PRX_TEST_CE_0_AT_RXDR      0x0504  // test CE=0 && switch role to ptx
#ifdef _CODE_TRMODE_PRX_
/**
 *  @ingroup BC3601_Host_FSM1_public_by_Holtek_label
 */
void entry_hfsm1_prx(void)
{
    hfsm1.trmode = TRMODE_PRX ;
    hfsm1.state = ST_0;
}
/**
 *  @ingroup BC3601_Host_FSM1_public_by_Holtek_label
 */
void exit_hfsm1_prx(void)
{
    spi_cmd0_0C_lightsleep();    //exit
    hfsm1.trmode = 0;
    hfsm1.state = ST_0;
}
/**
 *  @ingroup BC3601_Host_FSM1_private_by_Holtek_label
 */
/*
static void debug_print_rssi(void)
{
    unsigned char rssi;
//bank 0
    spi_cmd0_20_set_register_bank(0);
    uart_puts("STA1=");  rssi=spi_r(0x26); uart_putu8(rssi); uart_puts("  ");  //uart_putchar_n('\n');
    uart_puts("rssi1="); rssi=spi_r(0x27); uart_putu8(rssi); uart_puts("  ");  //uart_putchar_n('\n');
    uart_puts("rssi2="); rssi=spi_r(0x28); uart_putu8(rssi); uart_puts("  ");  //uart_putchar_n('\n');
    uart_puts("rssi3="); rssi=spi_r(0x29); uart_putu8(rssi); uart_puts("  ");  //uart_putchar_n('\n');
    uart_puts("ffidx="); rssi=spi_r(0x2F); uart_putu8(rssi); uart_puts("  ");  //uart_putchar_n('\n');
}*/
static void debug_rxpackets_from_ptx_not_consecutive(unsigned char len, unsigned char *pPayload)
{
    static unsigned char expected_length_from_ptx;
    static unsigned char expected_payload_0_from_ptx;
    unsigned char i;
    bool isCorrectPayload = TRUE;

    for(i=0; i<len; i++) {
        if( pPayload[i] != ((expected_payload_0_from_ptx+i)&0xFF) ) isCorrectPayload=FALSE;
    }
    if (//expected_length_from_ptx != len  ||
                isCorrectPayload != TRUE )
    {
        uart_puts("ERROR !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! "); uart_putchar_n('\n');uart_putchar_n('\n');uart_putchar_n('\n');
    }
    expected_length_from_ptx = len+1;
    if(expected_length_from_ptx>32) {expected_length_from_ptx=1;}

    expected_payload_0_from_ptx = pPayload[0]+1;
}
static void prx_process_possible_rxdr_before_roleswitch_to_ptx(void)
{
    unsigned char r_irq1, r_irq2;
            if (GPIO_IRQ3_IS_RESET())
            {
                r_irq1 = spi_read_n_clear_irq1();
                if( r_irq1 & 0x40 ) {                   // [6]RX_DR
                while( !((r_irq2 = spi_read_fifostatus()) & 0x01)) { // RX_EMPTY
                        unsigned char rx_pipe_no;
                        rx_pipe_no = spi_r(0x02);        rx_pipe_no=(rx_pipe_no&0x0E)>>1; // RC2 [3:1]RX_P_NO (RO read only)
//                                                       rx_pipe_no=(    r_irq1&0x0E)>>1;
                    spi_read_rxfifo_to_spiRxQ();
                        debug_rxpackets_from_ptx_not_consecutive(spiRxQ.w_index, spiRxQ.payload+0);
                        uart_puts("___________RX_P_NO=");     uart_putu8(rx_pipe_no);     uart_puts("  ");  //uart_putchar_n('\n');
                    callback_spiRxQ_process_at_hfsm2();
                }
                }
            }
}
static void host5602_fsm1_prx(void)
{
    unsigned char r_irq1, r_irq2;
    static unsigned char  aaaaaa;
		static int debug_i;
    switch(hfsm1.state)
    {
    case ST_PRX_SETTING:
            spi_w(0x15, 0x00);                  //CE      [5:1]-,   [0]CE
            spi_w(0x03, 0x01|0x00);                //MASK CONFIG [7]-, [6]MASK_RX, [5]MASK_TX, [4]MASK_MAX_RT, [3]-, [2-, [1]-, [0]PRIM_RX=1:PRX          
            spi_cmd0_20_set_register_bank(0);
            spi_w(0x37, P5ACTIVE | P4ACTIVE | P3ACTIVE | P2ACTIVE | P1ACTIVE | P0ACTIVE); //DM4  (02_EN_RXADDR)
            spi_cmd0_89_rxfifo_flush();
            spi_clear_irq1();
            hfsm1.state = ST_PRX_SET_ING;
        break;
    case ST_PRX_SET_ING:


								macroCSN_SELECT_FPGA;
                spi_cmd0_20_set_register_bank(0);
		/*
								 if (DPL2_EN_ACK_PLD == 0x02)
                {

                    if( !(spi_read_fifostatus()&0x20) )  // not TX_FULL
                    {
                        movedata_to_spiTxQ___prx();
                        movedata_spiTxQ_to_prx_txfifo(spiTxQ.remote_pipe_no);
											
                    }
                }*/
									
									spi_w(0x15, 0x01);                  //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE
               // while( (spi_r(0x26)&0x07)!=0x05 ) {;}       // STA1  [2:0]OMST 0:Deep Sleep Mode, 2:Light Sleep Mode, 4:TX Mode, 5: RX Mode, 6:Calibration mode
            
						hfsm1.delay_offset = tmr50usGetCurrentTicks();
            hfsm1.state = ST_PRX_W4_RXCOMPLETE;
        break;
    case ST_PRX_W4_RXCOMPLETE:
             #if 0
                if( //(spi_read_fifostatus()&0x10) &&  // TX_EMPTY
                    tmr50usIsExpired(hfsm1.delay_offset,  300+ (rand()&0x3FF) ) )
                {
                    spi_w(0x0A, 0x00);                  //CE      [7]DISABLED_TXEN, [6]DISABLED_RXEN,  [5:1]-,   [0]CE
                    hfsm1.delay_offset = tmr50usGetCurrentTicks();
                    hfsm1.state = ST_PRX_TEST_CE_0_AT_ANYTIME;
                    break;
                }
                #endif
						//uart_puts("gain_sel= ");uart_putu8(spi_r(0x22)); //uart_putchar_n('\n');
							spi_cmd0_20_set_register_bank(1);
							spi_r(0x22);
            if (GPIO_IRQ3_IS_RESET())
            {
								//delay_unit_50us(0);
                r_irq1 = spi_read_n_clear_irq1();
								
//r_irq2=spi_read_fifostatus();
//uart_puts("r_irq2="); uart_putu8(r_irq2); uart_puts(" ");
              //if( r_irq1 & 0x10 ) {                   // [4]MAX_RT, PRX no MAX_RT
              //}
              //if( r_irq1 & 0x20 ) {                   // [5]TX_DS   ack_payload is confirmed by "PID from remote PTX is different"
              //}
                if( r_irq1 & 0x40 ) {                   // [6]RX_DR											
							unsigned char rx_pipe_no;									
									 debug_i++;
									spi_cmd0_09_txfifo_flush();
                r_irq2 = spi_read_fifostatus();
									
								//uart_putu8(r_irq2);
              //  if( r_irq2 & 0x02 ) {                   // RX_FULL    test: wait RX_FULL then read
                 {
                        
                      //unsigned char rssi;
												//spi_cmd0_20_set_register_bank(1);
												//uart_puts("gain_sel= ");uart_putu8(spi_r(0x22)); //uart_putchar_n('\n');
												spi_cmd0_20_set_register_bank(0);
												uart_puts("rssi= ");uart_putu8(spi_r(0x29)); //uart_putchar_n('\n');
                        rx_pipe_no=(r_irq1&0x0E)>>1; // RC2 [3:1]RX_P_NO (RO read only)
												spi_read_rxfifo_to_spiRxQ();
                        debug_rxpackets_from_ptx_not_consecutive(spiRxQ.w_index, spiRxQ.payload+0);
                      //debug_print_rssi();
                      //uart_puts("fifoSTATUS=");  uart_putu8(r_irq2);     uart_puts("  ");  //uart_putchar_n('\n');
												uart_puts("packets_i= ");uart_putu16(debug_i); //uart_putchar_n('\n');
                        uart_puts(" RX_P_NO=");     uart_putu8(rx_pipe_no); uart_puts("  ");  //uart_putchar_n('\n');
                   callback_spiRxQ_process_at_hfsm2();
                }// while( ((r_irq2 = spi_read_fifostatus()) & 0x01)==0x00 ); // [0]RX_EMPTY
               // }
								if (DPL2_EN_ACK_PLD == 0x02)
                {
                    if( !(spi_read_fifostatus()&0x20) )  // not TX_FULL
                    {
                        movedata_to_spiTxQ___prx();
                        //movedata_spiTxQ_to_prx_txfifo(spiTxQ.remote_pipe_no);
											movedata_spiTxQ_to_prx_txfifo(rx_pipe_no);
                    }
                }	
                }
								
