WhiteWaterkwon/5603SZ/ht32f1656/5603/BC5603v4_SZ_20231016/231016_withnrf24/bc5602_host.c
            }						
        break;
						
    case ST_PRX_TEST_CE_0_AT_ANYTIME:
                prx_process_possible_rxdr_before_roleswitch_to_ptx();
                if(tmr50usIsExpired(hfsm1.delay_offset,     20))
                {
                    hfsm1.state = ST_PRX_SET_ING;
                }
        break;
    case ST_PRX_TEST_CE_0_AT_RXDR:
                prx_process_possible_rxdr_before_roleswitch_to_ptx();
                if(tmr50usIsExpired(hfsm1.delay_offset,    200))
                {
                    hfsm1.state = ST_PRX_SET_ING;
                }
        break;
    }
}
#endif


/**
 *  @ingroup BC3601_Host_FSM1_private_by_Holtek_label
 */
static void host5602_fsm1(void)
{
    macroCSN_SELECT_FPGA;

    switch(hfsm1.state)
    {
    case ST_0:
        if (hfsm1.trmode == 0) {break;}
        
        if (hfsm1.trmode == TRMODE_PTX) {
uart_puts("5602BLE  PTX   CH="); uart_putu8(RFCH_FRONTEND); uart_putchar_n('\n');
            hfsm1.state = ST_PTX_SETTING;
        }
        if (hfsm1.trmode == TRMODE_PRX) {
uart_puts("5602BLE  PRX   CH="); uart_putu8(RFCH_FRONTEND); uart_putchar_n('\n');
            hfsm1.state = ST_PRX_SETTING;
        }
            break;
    }
    
    #ifdef _CODE_TRMODE_PTX_
    host5602_fsm1_ptx();
    #endif
    #ifdef _CODE_TRMODE_PRX_
    host5602_fsm1_prx();
    #endif
}


////////////////////////////////////////
/**
 *  @ingroup BC3601_Host_FSM1_public_by_Holtek_label
 */
void host5602_process(void)
{
        #if   DATARATE == 250
				dm1_mdiv_sel = 0x80;
        dm1_mdiv_sdr = 0x20;
        #elif DATARATE == 1000
        dm1_mdiv_sel = 0x40;
				dm1_mdiv_sdr = 0x10;
				#elif DATARATE == 2000
				dm1_mdiv_sel = 0x00;
				dm1_mdiv_sdr = 0x00;
        #endif

        #if   DATARATE == 250
        dm1_d_rate = 0x00;
        #elif DATARATE == 1000
        dm1_d_rate = 0x01;
				#elif DATARATE == 2000
				dm1_d_rate = 0x02;
                                                    //0x00, DM1 [2:0]=000: 250 kbps datarate
                                                    //0x01, DM1 [2:0]=001:   1 Mbps datarate
																										//0x02, DM1 [2:0]=010:   2 Mbps datarate
																										
																										
        #endif
        
        dm1_aw          = DM1_AW ;          //setting @bc5602_host.h
        pkt1_crc_en   = PKT1_CRCEN ; //setting @bc5602_host.h
        pkt1_crc8_en  = PKT1_CRC8EN;      //setting @bc5602_host.h
        pkt2_wht_en     = PKT2_WHT_EN;      //setting @bc5602_host.h
        dpl2_en_dyn_ack = DPL2_EN_DYN_ACK;  //setting @bc5602_host.h
        dpl2_en_ack_pld = DPL2_EN_ACK_PLD;  //setting @bc5602_host.h
        dpl2_en_dpl     = DPL2_EN_DPL;      //setting @bc5602_host.h
        en_inv_noack    = DPL2_EN_INV_NOACK;//setting @bc5602_host.h
        
        init_mcu();
        init_5602();

        while(1)
        {
            host5602_fsm1();
            host5602_fsm2();
            
        }//while(1)
    
}



